package com.brazzers.aio;

import android.app.Activity;
import android.content.Context;
import android.text.Html;
import android.widget.Toast;
import de.robv.android.xposed.IXposedHookLoadPackage;
import de.robv.android.xposed.XC_MethodHook;
import de.robv.android.xposed.XC_MethodReplacement;
import de.robv.android.xposed.XposedHelpers;
import de.robv.android.xposed.callbacks.XC_LoadPackage;

/* loaded from: classes.dex */
public /* synthetic */ class HookInit implements IXposedHookLoadPackage {

    /* renamed from: F̵̡̧̧̩̜̫̥̝̙̫̘͇̘͍͙̝̪͈̞͚̙̩̞͌̀̓͂̍̑̚̚R̷̨̢̛̖̦̺̻͕̜̪̥̣̮̘̱̉͒͊͋̇͒̇͌̂̂͋̂͋͒̂̐̔͋͌̔̈́͆̒͒̑̿̆͑̿̑̋͒̊̔̏͠͠͠1̵̡̢͈̙͙͍̞̯̪̤̫̦͕͓͍̹̳̞̳̮͓̼͑̄͐̀̕͝Ë̴̢̧̧̡̡̢̧̛̛̠̖̲̘͙͇̤̺͓͖̗̞͖̞̣̮̮͚̦͓͍͖͚̣͙͍̬̞̙̙̖͓̜̽̇̀̉͂̾̓̈́͂́̾͗̽͐ͅͅŅ̸̧̢̧̲̣͙̠̩̲̦̦̻̩̟͖̤͈̲̰̜̍̄ͅD̸̢̧̛̛͖̖̞̩͓̩̫̐̽̐́͂́̆̈̐̀͋̎̎̋̂͋̇̓̀̀̋̉́̂̐̏̎̒̀͌̽̎̚͘̚͠͠Ş̶̢̣̼̬̺̞̮̟̜͖̖̭͙͎̻͖͚͚̲̘̼̫̹̹̖̔_̸̨͉̞̮̟̗̬̭̙͇͙̲̥̯̮͈̬̺̫̞̮̤̔̒͗̽̈́̓̈́͌͒̾̆̈́͑͋̌̉͑̂̏͂̽̍̓͘͜Å̶̡̨̛͈̺͙̳͇̠͙͎̘̼̜̤̪̠̼̲͓͋͊̋̓̿̉͑̑̓͗̐̈́̚͝, reason: contains not printable characters */
    static /* synthetic */ char[] f0x2d4ede4f;

    /* renamed from: F̵̡̧̧̩̜̫̥̝̙̫̘͇̘͍͙̝̪͈̞͚̙̩̞͌̀̓͂̍̑̚̚R̷̨̢̛̖̦̺̻͕̜̪̥̣̮̘̱̉͒͊͋̇͒̇͌̂̂͋̂͋͒̂̐̔͋͌̔̈́͆̒͒̑̿̆͑̿̑̋͒̊̔̏͠͠͠1̵̡̢͈̙͙͍̞̯̪̤̫̦͕͓͍̹̳̞̳̮͓̼͑̄͐̀̕͝Ë̴̢̧̧̡̡̢̧̛̛̠̖̲̘͙͇̤̺͓͖̗̞͖̞̣̮̮͚̦͓͍͖͚̣͙͍̬̞̙̙̖͓̜̽̇̀̉͂̾̓̈́͂́̾͗̽͐ͅͅŅ̸̧̢̧̲̣͙̠̩̲̦̦̻̩̟͖̤͈̲̰̜̍̄ͅD̸̢̧̛̛͖̖̞̩͓̩̫̐̽̐́͂́̆̈̐̀͋̎̎̋̂͋̇̓̀̀̋̉́̂̐̏̎̒̀͌̽̎̚͘̚͠͠Ş̶̢̣̼̬̺̞̮̟̜͖̖̭͙͎̻͖͚͚̲̘̼̫̹̹̖̔_̸̨͉̞̮̟̗̬̭̙͇͙̲̥̯̮͈̬̺̫̞̮̤̔̒͗̽̈́̓̈́͌͒̾̆̈́͑͋̌̉͑̂̏͂̽̍̓͘͜ų̴̢̢̨̨̹̩̙͎̝̪͔͖͎͙̙̖̦͍͓͈̰̜͚̤̼̺̯̙͍͖͎̦͔̯̻͚̭̎̾̈́̊͊̇̃̚̚̕ͅv̴̧̭̟̳̟͉͎̜̗͍͚̭̙̠͓̝̝̘͇̱͈̊́̆̑̈̽̑͂͒̌̀̓̊̆̆̊̈́̋͐̎̽̇̄͆̅̉̈́̽͆̚̕̕̕̕͜͜s̷̢̧̲̱̳̖̬͙̱͕̮̩̺̣̪̼͔̮͚͓͇͓̲̣̥͇̬̪̹̞̼̣͌͊̄̏̅̇̾͜͠ͅi̷̢̡̡̢̢̨̹͓̼̦̣͇̖͇͕̬̠̖̗̞̝͖̤̮̠̩̰̰̭̱̟̞͈̫͉̔̽̌̓̏͜͝ͅc̸̡̢̨̨͕̯̝̲̟͍̩̹͍̪̼͖͈͍̺͓͎͎̖̗̠̞̰̻͓͎̟͚̝͙͓̘͇̯̺̞͚̬̓̉̋͗̅̔̈́́̃͌́̇͛͂̏̉̏̉̂͒̍͜q̸͍̟͍͕̹͉̤̱̏̆͗́̈́̓̈̆̊͝͝͝j̴̨̛̦̱̦̮̪̲͖̱͚͈̹̭̊̂͛̍̎̇̽͆̎̔̏̂̉̓̓͌̌̂̓͋̐̒̽̂̿̔̈́͗͘̕͝͝͝͝͝ͅn̷̢̡̛͕̟͚͙̳̯͇͍͍͙̙͕̲͎͚̦̳͕̱͕̺̱̬͓̖̠̻͎̜̮̥̝̼̋̈́͑͑̾̅̾̐̿n̷̢̡̛͕̟͚͙̳̯͇͍͍͙̙͕̲͎͚̦̳͕̱͕̺̱̬͓̖̠̻͎̜̮̥̝̼̋̈́͑͑̾̅̾̐̿s̷̢̧̲̱̳̖̬͙̱͕̮̩̺̣̪̼͔̮͚͓͇͓̲̣̥͇̬̪̹̞̼̣͌͊̄̏̅̇̾͜͠ͅw̶̢̪̤̫̱̩̣͕̱͓̩͓̩̱̞̯͉͔̺̙͇̝̹̻̯̮͔̰̙̾̏̑̑͗̅͆͂͊͛̒͐̓̈́̃͂́͜͠͝p̸̨̩̤̥̜͔͕̙̲͍͚̮̩͉͎͓̣̗͕̽̉͛͑̀̏̿̾̿̏̾̋͋͊̋́̈́̊̈́͗̃̃̅̈́̇̏̂͑̊̚͝͠, reason: contains not printable characters */
    static final int f1x2940f721 = 0;

    static {
        char c;
        char[] charArray = "\u0005̩ͫ̅̓ͽ͚͎͏̧͓͈͎̿͟͵ͬʹ̙̰̝͍̞͌̀̄͆̄͐̄͐̀͝5̵̢̢̢̯̟̬͎͊̌̃̇̏͋̂͊́͌͜͝ͳ̛̅͌͜\u0378̿͡\u0378̣̘̾Ͳ̿Ͷ̨͔̓̑ͦ͝ͱ̾\u0379̜ͥ͵̪̻͂ͭ͆\u0378͋1̴͉͇̯̹͚͒̎̀̇̄͜ͷ̯͍̼͡͵̡̼͓̪ͯͰ̀ͺ͇͓͛]ͷ͖ʹ͚ͮ̀ͮͽ̛͍̫̦̙̍ͦ̔ͣͲ̢͇̎ͱ̢̰͇͆̌̓̐̈͞ͷ̢͖̿͝ͽ͇̮̹̤͖̙ͮ̽ͥ̍ͨ̿ͅͽ̤̬̐\u0379͚͈́̚͵N͇̰̠͎ͬͪ̿̕͟ͱ\u0378̩ͯ͒\u0378͎ͤͺ̡̧͕ͫ͝ͳ͂\r͚̜͈͑̐̈͂ͯ̈ͽ̈̾̉͘Ͳ̖͈̘͈͈͋ͩ̂ͮ̓ͧ͗ͫ͘͜ͷ\u0378̫̥͍͌͐͛ͩ̈ͫ̚Ϳ̞͎̿̐ͷ͢:̶ͳ̻͓̞͉͙̩̺ͤͥ̇̈̈́͢͟͟\u0378̳̲̈̓Ϳ̤ͨͧͰͿ_̞͔̌͑̆̈́͟ʹ̏̌͜ͷ̶͓ͯ̈́͏̵̘̥̥͎͍̞͉͔͗ͫ̏̀̇Ͳ̙̠̈́́͡ͱͻ̢͇͈͍ͦ͋ͨ̀ͧ扼圳借怬冂墟報僋挪厮噌恽房敃沭垎壹播侱挾桠湿擀殯巇歓栓孛復儷厽嗇劢委殞勩埉枎揲瀒净憜炶欝淝灴濩夸垚湎層圵橚巹歲侔嗫崰敏添亡屬炆弓圩嬓彚潾姝橺入嵖婚喛媭掃懼図媧佌夼墵幒拜摊涫審溛氻挣梃敘斨搲煳煓暉呇滧捽檞".toCharArray();
        int length = charArray.length;
        for (int i = 0; length > i; i++) {
            char c2 = charArray[i];
            switch (i % 7) {
                case 0:
                    c = 'C';
                    break;
                case 1:
                    c = '^';
                    break;
                case 2:
                    c = 'I';
                    break;
                case 3:
                    c = 'i';
                    break;
                case 4:
                    c = 0;
                    break;
                case 5:
                    c = 'g';
                    break;
                default:
                    c = 24;
                    break;
            }
            charArray[i] = (char) (c ^ c2);
        }
        f0x2d4ede4f = new String(charArray).intern().toCharArray();
    }

    public static /* bridge */ /* synthetic */ void g(Context context) {
        if (((context.getSharedPreferences(context.getPackageName(), 0).getBoolean(m0xbb4d8ad(1805032796, 1690206382, "\ud7c9풶퓏퓚풏풢퓼풨", 454061019, 1389928898), true) ? 1 : 0) << 0) / 1 != 0) {
            Toast.makeText(context, Html.fromHtml(m0xbb4d8ad(-1591627254, 1209343166, "闟雱雕雜雔雗随雥隬雧雑雓雟雏隺隝隓雍雈隂隺雥隻難雪雃雄隴雴隸雷雉隻閶雉隳雯雧隮隔雁隍隍雚雇雗隖雑雓雔隄隋雖雑隕隕隉雟電隿雯雟隻隴隧隉隅隰隅隈雃隳隯隸隙隧隌隈隅雥雵雓隔障隑难雜雎䷁䪀", 341167001, -1681330040)), 1).show();
            context.getSharedPreferences(context.getPackageName(), 0).edit().putBoolean(m0xbb4d8ad(-802952663, 533387142, "\uec3a\uef41\uef38\uef21\uef74\uef65\uef3b\uef6b", 253634645, 2002123234), false).apply();
        }
    }

    /* renamed from: k̶̨̢̡̧̧̛̼̠̺̻̱̪̟͕̻̮̼̲̥̭͚͓͖͙̼̤̠̃̐̑͊͒͛͗̈́͂̾̓̾̎̿̆̅̊̒̈́͐̍̒̉̈́̈́̽͑̄̈́̊̄̒͆̾̎̕̕̚̕͜s̷̢̧̲̱̳̖̬͙̱͕̮̩̺̣̪̼͔̮͚͓͇͓̲̣̥͇̬̪̹̞̼̣͌͊̄̏̅̇̾͜͠ͅp̸̨̩̤̥̜͔͕̙̲͍͚̮̩͉͎͓̣̗͕̽̉͛͑̀̏̿̾̿̏̾̋͋͊̋́̈́̊̈́͗̃̃̅̈́̇̏̂͑̊̚͝͠v̴̧̭̟̳̟͉͎̜̗͍͚̭̙̠͓̝̝̘͇̱͈̊́̆̑̈̽̑͂͒̌̀̓̊̆̆̊̈́̋͐̎̽̇̄͆̅̉̈́̽͆̚̕̕̕̕͜͜l̶̛͙͖͖͙̻̪̦͚͓̖̳̤͙͖̭͖͖̘̠̠͉̲̬͎̫̼̗̹̪͉͚̫̗͍͉͍̹͕̻̯̰̏͌̊̆̒̈́̍̀́̽̾̎̃̒́̆̽̂̄̆̕͝x̴̧̨̨͖̤͙͓͎͎̞͖̮̲̦͖̦̞̘͔̩͓̦̭͍̣͉̹̯͔̖̖͐́͂̉, reason: contains not printable characters */
    private static /* bridge */ /* synthetic */ String m0xbb4d8ad(int i, int i2, String str, int i3, int i4) {
        "f̴̡̡̡̢̗̻̮̬͇̪͓̤̣̰̝̩̲͇̹̪̩̻͎͍͙̼̖͈̥̲̱̈̑͆͊͋̍̎́͆͋͛̈̑̾̇̈́͊͘͝͝͝".length();
        "t̷̢̨̗̳̹̪̩̣̹̼̹̭̫̮͚̣̹̝͚̞͖͈̹̳͈̙͙͎̼̠̩̜̬̙̰͈̮̰̣͒͐̇̽̇͋̈̓̓̌͒̃̒͜͜͝ͅͅ".length();
        StringBuilder sb = new StringBuilder();
        char[] charArray = str.toCharArray();
        "n̷̢̡̛͕̟͚͙̳̯͇͍͍͙̙͕̲͎͚̦̳͕̱͕̺̱̬͓̖̠̻͎̜̮̥̝̼̋̈́͑͑̾̅̾̐̿q̸͍̟͍͕̹͉̤̱̏̆͗́̈́̓̈̆̊͝͝͝".length();
        int length = charArray.length;
        int i5 = 0;
        int i6 = 0;
        while (i5 < length) {
            sb.append((char) ((((charArray[i5] ^ f0x2d4ede4f[i6 % f0x2d4ede4f.length]) ^ ((i3 + i6) ^ i)) ^ i2) ^ i4));
            "ȟ̸̡̢̨͍͚̝̲̝̫̟̲͎̲̼̬̦͓̺̭̼̪̜̠͈̭̗̳̳̣͓̟̲̻̜͇̰̞̝̾͂͌̈́̎́́̔̈́͋̀̿̀̍̈́͆͊̔̿͊̅̓́̈́̆̃̽͛̋͂̄̓̌̂͆̚͜͜͝͝͝͠͝j̴̨̛̦̱̦̮̪̲͖̱͚͈̹̭̊̂͛̍̎̇̽͆̎̔̏̂̉̓̓͌̌̂̓͋̐̒̽̂̿̔̈́͗͘̕͝͝͝͝͝ͅ".length();
            "m̵̡̫̙͔̜͙͇͈̝̲̱͕̱̤̟̭̭̙̠͎̬̦͇͎͙͓̰̣̻̥̦̒͊̎̈́̾̾̾͒̃͂͐̉̎̌͂̀͒͗͒̇́̀͛̌́͊̓̈́̀́̀̂̀̕̚̚̚͜͝͝͝͝͝͠͝t̷̢̨̗̳̹̪̩̣̹̼̹̭̫̮͚̣̹̝͚̞͖͈̹̳͈̙͙͎̼̠̩̜̬̙̰͈̮̰̣͒͐̇̽̇͋̈̓̓̌͒̃̒͜͜͝ͅͅ".length();
            i5++;
            i6++;
        }
        return sb.toString();
    }

    public /* bridge */ /* synthetic */ void handleLoadPackage(XC_LoadPackage.LoadPackageParam loadPackageParam) throws Throwable {
        if (((loadPackageParam.packageName.equals(m0xbb4d8ad(1646656927, -624656508, "咟埣垙埩埽埨垯埠埵埴埒垆埄埚埥埘埋埱埧埕埭垷埿", -770424675, -479947204)) ? 1 : 0) & 48305) != 0) {
            String m0xbb4d8ad = m0xbb4d8ad(384610966, -1295915266, "窽秃离秵秨秨禳秵秭秮禝秕秓秖秸秓秄称禽秇秹禹禸禯禸秬秛秥称禱秶禀秓窟秤秞秀禹禔秌禋秀禛秹秓禒秄禙禈", -1812883264, 765965872);
            ClassLoader classLoader = loadPackageParam.classLoader;
            String m0xbb4d8ad2 = m0xbb4d8ad(941111490, 1986022153, "쫮즆집짼", -1290504854, 882887776);
            "c̸̡̢̨̨͕̯̝̲̟͍̩̹͍̪̼͖͈͍̺͓͎͎̖̗̠̞̰̻͓͎̟͚̝͙͓̘͇̯̺̞͚̬̓̉̋͗̅̔̈́́̃͌́̇͛͂̏̉̏̉̂͒̍͜".length();
            "c̸̡̢̨̨͕̯̝̲̟͍̩̹͍̪̼͖͈͍̺͓͎͎̖̗̠̞̰̻͓͎̟͚̝͙͓̘͇̯̺̞͚̬̓̉̋͗̅̔̈́́̃͌́̇͛͂̏̉̏̉̂͒̍͜f̴̡̡̡̢̗̻̮̬͇̪͓̤̣̰̝̩̲͇̹̪̩̻͎͍͙̼̖͈̥̲̱̈̑͆͊͋̍̎́͆͋͛̈̑̾̇̈́͊͘͝͝͝s̷̢̧̲̱̳̖̬͙̱͕̮̩̺̣̪̼͔̮͚͓͇͓̲̣̥͇̬̪̹̞̼̣͌͊̄̏̅̇̾͜͠ͅ".length();
            "ȟ̸̡̢̨͍͚̝̲̝̫̟̲͎̲̼̬̦͓̺̭̼̪̜̠͈̭̗̳̳̣͓̟̲̻̜͇̰̞̝̾͂͌̈́̎́́̔̈́͋̀̿̀̍̈́͆͊̔̿͊̅̓́̈́̆̃̽͛̋͂̄̓̌̂͆̚͜͜͝͝͝͠͝m̵̡̫̙͔̜͙͇͈̝̲̱͕̱̤̟̭̭̙̠͎̬̦͇͎͙͓̰̣̻̥̦̒͊̎̈́̾̾̾͒̃͂͐̉̎̌͂̀͒͗͒̇́̀͛̌́͊̓̈́̀́̀̂̀̕̚̚̚͜͝͝͝͝͝͠͝w̶̢̪̤̫̱̩̣͕̱͓̩͓̩̱̞̯͉͔̺̙͇̝̹̻̯̮͔̰̙̾̏̑̑͗̅͆͂͊͛̒͐̓̈́̃͂́͜͠͝ơ̸̡̡̛͓̰̖͉̤͉̖͔̰͍̤̠̠̱̫͎̭̩͖̻̞̼͓̞͋͐́̉͑̿́͋̌̂̀͊͛̀̄̊͊̓̄͘̚̕̕͜͝͝ͅͅ".length();
            "v̴̧̭̟̳̟͉͎̜̗͍͚̭̙̠͓̝̝̘͇̱͈̊́̆̑̈̽̑͂͒̌̀̓̊̆̆̊̈́̋͐̎̽̇̄͆̅̉̈́̽͆̚̕̕̕̕͜͜".length();
            "".length();
            "ḋ̴̡̯̱̞͈̦̯͍̩̯͌̀̑̓̔̈́̅̓͋̃͂̈́̈́͆́̄̓́̄̚̕̚͝z̴̨̧̛̛̛̞̱̗͍̖̰͉̝̯̗̻̰̙̹̺̪̭͇̫̪̫̟̗̖͚̼̩͔̝̥͍̹͈̜̆̉̈́̋̀͐̈́̾̉̀̄̈́̀͗̏͆̾̇̆͑̂̂̔̆̎́̇̕̚͜͜͝͠ŗ̶̢̢̛̛͇͉͍̪̳̟̞͔̥̣̞̙̩̬̻̱͉͚̭̲̭̫̩̘̺͇̬̱̰͍̖͕͎͎̺̻̪̑͌̋̊̿̆̊͛̅̔̊͛̑̍́͊̐̾͘͜͠͠ͅͅ".length();
            XposedHelpers.findAndHookMethod(m0xbb4d8ad, classLoader, m0xbb4d8ad2, new Object[]{XC_MethodReplacement.returnConstant(new Boolean(true))});
            "n̷̢̡̛͕̟͚͙̳̯͇͍͍͙̙͕̲͎͚̦̳͕̱͕̺̱̬͓̖̠̻͎̜̮̥̝̼̋̈́͑͑̾̅̾̐̿c̸̡̢̨̨͕̯̝̲̟͍̩̹͍̪̼͖͈͍̺͓͎͎̖̗̠̞̰̻͓͎̟͚̝͙͓̘͇̯̺̞͚̬̓̉̋͗̅̔̈́́̃͌́̇͛͂̏̉̏̉̂͒̍͜b̶̢̛͚̝̰̺̱̲͖̠̘͚͕͉͇̭̗͇̙̗̣͍̲͖̽͗̐̅̾̅́͌̂̚͘͝v̴̧̭̟̳̟͉͎̜̗͍͚̭̙̠͓̝̝̘͇̱͈̊́̆̑̈̽̑͂͒̌̀̓̊̆̆̊̈́̋͐̎̽̇̄͆̅̉̈́̽͆̚̕̕̕̕͜͜".length();
            "s̷̢̧̲̱̳̖̬͙̱͕̮̩̺̣̪̼͔̮͚͓͇͓̲̣̥͇̬̪̹̞̼̣͌͊̄̏̅̇̾͜͠ͅn̷̢̡̛͕̟͚͙̳̯͇͍͍͙̙͕̲͎͚̦̳͕̱͕̺̱̬͓̖̠̻͎̜̮̥̝̼̋̈́͑͑̾̅̾̐̿".length();
            "g̵̢̢̛̛͎͈͚̟͎͖͙͖̗̞̫̠͎͍̘͈͕͖͇̯͐͑̔̊͑͛͑͌͑̀̓͠".length();
            "k̶̨̢̡̧̧̛̼̠̺̻̱̪̟͕̻̮̼̲̥̭͚͓͖͙̼̤̠̃̐̑͊͒͛͗̈́͂̾̓̾̎̿̆̅̊̒̈́͐̍̒̉̈́̈́̽͑̄̈́̊̄̒͆̾̎̕̕̚̕͜a̸̧̻̭̥̩̮̲̝̹̩͍͚̤͈̠̭͓̜̬̭̥͊͗̓̅͋̉͐̿̐̇̑̓̎̒̔̏̇̃̉̂̾͂͋̌̑̀̾̈́̔̊̓̂́̕̕͘͜͠͠͠͠͝ḋ̴̡̯̱̞͈̦̯͍̩̯͌̀̑̓̔̈́̅̓͋̃͂̈́̈́͆́̄̓́̄̚̕̚͝".length();
            String m0xbb4d8ad3 = m0xbb4d8ad(38352288, 1467845453, "ኝᇣᆇᇉᇐᇐᆏᇉᇝᇞᆡᇩᇫᇮᇄᇯᇤᇐᆡᇛᇡᆡᆤᆳᆨᇼᇇᇹᇨᆩᇪᆜᇳ\u12bfᇘᇢᇸᆁᆨᇰᆻᇰᆧᇅᇫᆪᇸᆥᆨ", 920994830, 305522779);
            ClassLoader classLoader2 = loadPackageParam.classLoader;
            String m0xbb4d8ad4 = m0xbb4d8ad(-1047266102, 1527233739, "聙茵荀荓茝茀荽茞茔", 540279945, -1385446169);
            "k̶̨̢̡̧̧̛̼̠̺̻̱̪̟͕̻̮̼̲̥̭͚͓͖͙̼̤̠̃̐̑͊͒͛͗̈́͂̾̓̾̎̿̆̅̊̒̈́͐̍̒̉̈́̈́̽͑̄̈́̊̄̒͆̾̎̕̕̚̕͜j̴̨̛̦̱̦̮̪̲͖̱͚͈̹̭̊̂͛̍̎̇̽͆̎̔̏̂̉̓̓͌̌̂̓͋̐̒̽̂̿̔̈́͗͘̕͝͝͝͝͝ͅ".length();
            "".length();
            "f̴̡̡̡̢̗̻̮̬͇̪͓̤̣̰̝̩̲͇̹̪̩̻͎͍͙̼̖͈̥̲̱̈̑͆͊͋̍̎́͆͋͛̈̑̾̇̈́͊͘͝͝͝s̷̢̧̲̱̳̖̬͙̱͕̮̩̺̣̪̼͔̮͚͓͇͓̲̣̥͇̬̪̹̞̼̣͌͊̄̏̅̇̾͜͠ͅ".length();
            "".length();
            XposedHelpers.findAndHookMethod(m0xbb4d8ad3, classLoader2, m0xbb4d8ad4, new Object[]{XC_MethodReplacement.returnConstant(new Integer(80))});
            "".length();
            "ơ̸̡̡̛͓̰̖͉̤͉̖͔̰͍̤̠̠̱̫͎̭̩͖̻̞̼͓̞͋͐́̉͑̿́͋̌̂̀͊͛̀̄̊͊̓̄͘̚̕̕͜͝͝ͅͅ".length();
            "b̶̢̛͚̝̰̺̱̲͖̠̘͚͕͉͇̭̗͇̙̗̣͍̲͖̽͗̐̅̾̅́͌̂̚͘͝g̵̢̢̛̛͎͈͚̟͎͖͙͖̗̞̫̠͎͍̘͈͕͖͇̯͐͑̔̊͑͛͑͌͑̀̓͠s̷̢̧̲̱̳̖̬͙̱͕̮̩̺̣̪̼͔̮͚͓͇͓̲̣̥͇̬̪̹̞̼̣͌͊̄̏̅̇̾͜͠ͅḋ̴̡̯̱̞͈̦̯͍̩̯͌̀̑̓̔̈́̅̓͋̃͂̈́̈́͆́̄̓́̄̚̕̚͝".length();
            "ų̴̢̢̨̨̹̩̙͎̝̪͔͖͎͙̙̖̦͍͓͈̰̜͚̤̼̺̯̙͍͖͎̦͔̯̻͚̭̎̾̈́̊͊̇̃̚̚̕ͅų̴̢̢̨̨̹̩̙͎̝̪͔͖͎͙̙̖̦͍͓͈̰̜͚̤̼̺̯̙͍͖͎̦͔̯̻͚̭̎̾̈́̊͊̇̃̚̚̕ͅ".length();
            String m0xbb4d8ad5 = m0xbb4d8ad(811712879, 1605138179, "躿跁趹跷跢跢趹跿路跬趟跗贩贬贂贩账贒赟败贓赓赒赅赚贎费贇购资贕货败蹊贻贙赒赔赋贋", -45911436, -1467135358);
            ClassLoader classLoader3 = loadPackageParam.classLoader;
            String m0xbb4d8ad6 = m0xbb4d8ad(1142800452, 1585631380, "\u177fᐎᑛᑹᐼᐲᑾᐧ", 1690636141, 1486817515);
            Object[] objArr = new Object[2];
            "ơ̸̡̡̛͓̰̖͉̤͉̖͔̰͍̤̠̠̱̫͎̭̩͖̻̞̼͓̞͋͐́̉͑̿́͋̌̂̀͊͛̀̄̊͊̓̄͘̚̕̕͜͝͝ͅͅp̸̨̩̤̥̜͔͕̙̲͍͚̮̩͉͎͓̣̗͕̽̉͛͑̀̏̿̾̿̏̾̋͋͊̋́̈́̊̈́͗̃̃̅̈́̇̏̂͑̊̚͝͠g̵̢̢̛̛͎͈͚̟͎͖͙͖̗̞̫̠͎͍̘͈͕͖͇̯͐͑̔̊͑͛͑͌͑̀̓͠".length();
            "ȟ̸̡̢̨͍͚̝̲̝̫̟̲͎̲̼̬̦͓̺̭̼̪̜̠͈̭̗̳̳̣͓̟̲̻̜͇̰̞̝̾͂͌̈́̎́́̔̈́͋̀̿̀̍̈́͆͊̔̿͊̅̓́̈́̆̃̽͛̋͂̄̓̌̂͆̚͜͜͝͝͝͠͝".length();
            "s̷̢̧̲̱̳̖̬͙̱͕̮̩̺̣̪̼͔̮͚͓͇͓̲̣̥͇̬̪̹̞̼̣͌͊̄̏̅̇̾͜͠ͅn̷̢̡̛͕̟͚͙̳̯͇͍͍͙̙͕̲͎͚̦̳͕̱͕̺̱̬͓̖̠̻͎̜̮̥̝̼̋̈́͑͑̾̅̾̐̿ȟ̸̡̢̨͍͚̝̲̝̫̟̲͎̲̼̬̦͓̺̭̼̪̜̠͈̭̗̳̳̣͓̟̲̻̜͇̰̞̝̾͂͌̈́̎́́̔̈́͋̀̿̀̍̈́͆͊̔̿͊̅̓́̈́̆̃̽͛̋͂̄̓̌̂͆̚͜͜͝͝͝͠͝z̴̨̧̛̛̛̞̱̗͍̖̰͉̝̯̗̻̰̙̹̺̪̭͇̫̪̫̟̗̖͚̼̩͔̝̥͍̹͈̜̆̉̈́̋̀͐̈́̾̉̀̄̈́̀͗̏͆̾̇̆͑̂̂̔̆̎́̇̕̚͜͜͝͠".length();
            "ẙ̵̡̖͚̫̘̩͇͉͔̖͍̹͈̘͕̥͎̻̘͖̲̲͔̦͎̣͖͈̯̹̈́̓̋̈́̋̓͆̒̔̈́̒̎́̏̀͊̅̆̇͝͠͠ͅ".length();
            try {
                objArr[0] = Class.forName(m0xbb4d8ad(976350993, 305754929, "鈐酭鄙鄂酏酁郫郯邱邧郆邭邗邃邽邃邇", 1411864314, 1122982125));
                "p̸̨̩̤̥̜͔͕̙̲͍͚̮̩͉͎͓̣̗͕̽̉͛͑̀̏̿̾̿̏̾̋͋͊̋́̈́̊̈́͗̃̃̅̈́̇̏̂͑̊̚͝͠a̸̧̻̭̥̩̮̲̝̹̩͍͚̤͈̠̭͓̜̬̭̥͊͗̓̅͋̉͐̿̐̇̑̓̎̒̔̏̇̃̉̂̾͂͋̌̑̀̾̈́̔̊̓̂́̕̕͘͜͠͠͠͠͝".length();
                "ơ̸̡̡̛͓̰̖͉̤͉̖͔̰͍̤̠̠̱̫͎̭̩͖̻̞̼͓̞͋͐́̉͑̿́͋̌̂̀͊͛̀̄̊͊̓̄͘̚̕̕͜͝͝ͅͅẙ̵̡̖͚̫̘̩͇͉͔̖͍̹͈̘͕̥͎̻̘͖̲̲͔̦͎̣͖͈̯̹̈́̓̋̈́̋̓͆̒̔̈́̒̎́̏̀͊̅̆̇͝͠͠ͅ".length();
                "".length();
                "w̶̢̪̤̫̱̩̣͕̱͓̩͓̩̱̞̯͉͔̺̙͇̝̹̻̯̮͔̰̙̾̏̑̑͗̅͆͂͊͛̒͐̓̈́̃͂́͜͠͝".length();
                "ȟ̸̡̢̨͍͚̝̲̝̫̟̲͎̲̼̬̦͓̺̭̼̪̜̠͈̭̗̳̳̣͓̟̲̻̜͇̰̞̝̾͂͌̈́̎́́̔̈́͋̀̿̀̍̈́͆͊̔̿͊̅̓́̈́̆̃̽͛̋͂̄̓̌̂͆̚͜͜͝͝͝͠͝v̴̧̭̟̳̟͉͎̜̗͍͚̭̙̠͓̝̝̘͇̱͈̊́̆̑̈̽̑͂͒̌̀̓̊̆̆̊̈́̋͐̎̽̇̄͆̅̉̈́̽͆̚̕̕̕̕͜͜t̷̢̨̗̳̹̪̩̣̹̼̹̭̫̮͚̣̹̝͚̞͖͈̹̳͈̙͙͎̼̠̩̜̬̙̰͈̮̰̣͒͐̇̽̇͋̈̓̓̌͒̃̒͜͜͝ͅͅ".length();
                "".length();
                "a̸̧̻̭̥̩̮̲̝̹̩͍͚̤͈̠̭͓̜̬̭̥͊͗̓̅͋̉͐̿̐̇̑̓̎̒̔̏̇̃̉̂̾͂͋̌̑̀̾̈́̔̊̓̂́̕̕͘͜͠͠͠͠͝ẙ̵̡̖͚̫̘̩͇͉͔̖͍̹͈̘͕̥͎̻̘͖̲̲͔̦͎̣͖͈̯̹̈́̓̋̈́̋̓͆̒̔̈́̒̎́̏̀͊̅̆̇͝͠͠ͅ".length();
                "ŗ̶̢̢̛̛͇͉͍̪̳̟̞͔̥̣̞̙̩̬̻̱͉͚̭̲̭̫̩̘̺͇̬̱̰͍̖͕͎͎̺̻̪̑͌̋̊̿̆̊͛̅̔̊͛̑̍́͊̐̾͘͜͠͠ͅͅc̸̡̢̨̨͕̯̝̲̟͍̩̹͍̪̼͖͈͍̺͓͎͎̖̗̠̞̰̻͓͎̟͚̝͙͓̘͇̯̺̞͚̬̓̉̋͗̅̔̈́́̃͌́̇͛͂̏̉̏̉̂͒̍͜".length();
                objArr[1] = new XC_MethodHook() { // from class: com.brazzers.aio.HookInit.100000000

                    /* renamed from: F̵̡̧̧̩̜̫̥̝̙̫̘͇̘͍͙̝̪͈̞͚̙̩̞͌̀̓͂̍̑̚̚R̷̨̢̛̖̦̺̻͕̜̪̥̣̮̘̱̉͒͊͋̇͒̇͌̂̂͋̂͋͒̂̐̔͋͌̔̈́͆̒͒̑̿̆͑̿̑̋͒̊̔̏͠͠͠1̵̡̢͈̙͙͍̞̯̪̤̫̦͕͓͍̹̳̞̳̮͓̼͑̄͐̀̕͝Ë̴̢̧̧̡̡̢̧̛̛̠̖̲̘͙͇̤̺͓͖̗̞͖̞̣̮̮͚̦͓͍͖͚̣͙͍̬̞̙̙̖͓̜̽̇̀̉͂̾̓̈́͂́̾͗̽͐ͅͅŅ̸̧̢̧̲̣͙̠̩̲̦̦̻̩̟͖̤͈̲̰̜̍̄ͅD̸̢̧̛̛͖̖̞̩͓̩̫̐̽̐́͂́̆̈̐̀͋̎̎̋̂͋̇̓̀̀̋̉́̂̐̏̎̒̀͌̽̎̚͘̚͠͠Ş̶̢̣̼̬̺̞̮̟̜͖̖̭͙͎̻͖͚͚̲̘̼̫̹̹̖̔_̸̨͉̞̮̟̗̬̭̙͇͙̲̥̯̮͈̬̺̫̞̮̤̔̒͗̽̈́̓̈́͌͒̾̆̈́͑͋̌̉͑̂̏͂̽̍̓͘͜C̷̡̢̰̳̰̯͖̣͕̲̟̲̬̗̦̈́̆͆͋̍̒̿̽͜͠ͅ, reason: contains not printable characters */
                    static /* synthetic */ char[] f2x55ceac0b;

                    /* renamed from: F̵̡̧̧̩̜̫̥̝̙̫̘͇̘͍͙̝̪͈̞͚̙̩̞͌̀̓͂̍̑̚̚R̷̨̢̛̖̦̺̻͕̜̪̥̣̮̘̱̉͒͊͋̇͒̇͌̂̂͋̂͋͒̂̐̔͋͌̔̈́͆̒͒̑̿̆͑̿̑̋͒̊̔̏͠͠͠1̵̡̢͈̙͙͍̞̯̪̤̫̦͕͓͍̹̳̞̳̮͓̼͑̄͐̀̕͝Ë̴̢̧̧̡̡̢̧̛̛̠̖̲̘͙͇̤̺͓͖̗̞͖̞̣̮̮͚̦͓͍͖͚̣͙͍̬̞̙̙̖͓̜̽̇̀̉͂̾̓̈́͂́̾͗̽͐ͅͅŅ̸̧̢̧̲̣͙̠̩̲̦̦̻̩̟͖̤͈̲̰̜̍̄ͅD̸̢̧̛̛͖̖̞̩͓̩̫̐̽̐́͂́̆̈̐̀͋̎̎̋̂͋̇̓̀̀̋̉́̂̐̏̎̒̀͌̽̎̚͘̚͠͠Ş̶̢̣̼̬̺̞̮̟̜͖̖̭͙͎̻͖͚͚̲̘̼̫̹̹̖̔_̸̨͉̞̮̟̗̬̭̙͇͙̲̥̯̮͈̬̺̫̞̮̤̔̒͗̽̈́̓̈́͌͒̾̆̈́͑͋̌̉͑̂̏͂̽̍̓͘͜b̶̢̛͚̝̰̺̱̲͖̠̘͚͕͉͇̭̗͇̙̗̣͍̲͖̽͗̐̅̾̅́͌̂̚͘͝ẙ̵̡̖͚̫̘̩͇͉͔̖͍̹͈̘͕̥͎̻̘͖̲̲͔̦͎̣͖͈̯̹̈́̓̋̈́̋̓͆̒̔̈́̒̎́̏̀͊̅̆̇͝͠͠ͅŗ̶̢̢̛̛͇͉͍̪̳̟̞͔̥̣̞̙̩̬̻̱͉͚̭̲̭̫̩̘̺͇̬̱̰͍̖͕͎͎̺̻̪̑͌̋̊̿̆̊͛̅̔̊͛̑̍́͊̐̾͘͜͠͠ͅͅp̸̨̩̤̥̜͔͕̙̲͍͚̮̩͉͎͓̣̗͕̽̉͛͑̀̏̿̾̿̏̾̋͋͊̋́̈́̊̈́͗̃̃̅̈́̇̏̂͑̊̚͝͠ẙ̵̡̖͚̫̘̩͇͉͔̖͍̹͈̘͕̥͎̻̘͖̲̲͔̦͎̣͖͈̯̹̈́̓̋̈́̋̓͆̒̔̈́̒̎́̏̀͊̅̆̇͝͠͠ͅf̴̡̡̡̢̗̻̮̬͇̪͓̤̣̰̝̩̲͇̹̪̩̻͎͍͙̼̖͈̥̲̱̈̑͆͊͋̍̎́͆͋͛̈̑̾̇̈́͊͘͝͝͝p̸̨̩̤̥̜͔͕̙̲͍͚̮̩͉͎͓̣̗͕̽̉͛͑̀̏̿̾̿̏̾̋͋͊̋́̈́̊̈́͗̃̃̅̈́̇̏̂͑̊̚͝͠k̶̨̢̡̧̧̛̼̠̺̻̱̪̟͕̻̮̼̲̥̭͚͓͖͙̼̤̠̃̐̑͊͒͛͗̈́͂̾̓̾̎̿̆̅̊̒̈́͐̍̒̉̈́̈́̽͑̄̈́̊̄̒͆̾̎̕̕̚̕͜ŗ̶̢̢̛̛͇͉͍̪̳̟̞͔̥̣̞̙̩̬̻̱͉͚̭̲̭̫̩̘̺͇̬̱̰͍̖͕͎͎̺̻̪̑͌̋̊̿̆̊͛̅̔̊͛̑̍́͊̐̾͘͜͠͠ͅͅm̵̡̫̙͔̜͙͇͈̝̲̱͕̱̤̟̭̭̙̠͎̬̦͇͎͙͓̰̣̻̥̦̒͊̎̈́̾̾̾͒̃͂͐̉̎̌͂̀͒͗͒̇́̀͛̌́͊̓̈́̀́̀̂̀̕̚̚̚͜͝͝͝͝͝͠͝ȩ̵̛̛̹̱̳̝̱̝̌̊̓̍̋̃͐̂̌͌̔̈́̊̋̔͑̍́͋͆͛̏̑͒͐̃́͝͠͝ͅg̵̢̢̛̛͎͈͚̟͎͖͙͖̗̞̫̠͎͍̘͈͕͖͇̯͐͑̔̊͑͛͑͌͑̀̓͠, reason: contains not printable characters */
                    static final int f3x16c82f40 = 0;

                    static {
                        char c;
                        char[] charArray = "\u001ä̵̳̥̬͕̖̃̅́͑ͤ̀̀̀ͪ̋̂͘Ϳ̛̥̜̯͖̂̏̃͂ͧͬ̌{͕͐ͯ̅̎̕ͻ̵̸̷̸͍̭̣̯̝͔̭̯̼̞̭̺͙̐̿̎̐͛̎̽̇ͬ̎͛͊̿́ͦ̆̌̈́̚̚͢͠͞͞͝͞Ͳ̥;ͧ#̶̜͚̘ͭ̒͆ͤ̂͛̽̃̓͘͡ͅ;̖̣ͩ̐́ͤͯ͞ͼͫ́̕\"̵ͨͲ̨̠̥̮͙̟̰͂͒̋̇̉̋̀̉͢͞ͱ̥̜͕̞̼ͮ̊̍̏ͫ͛̈́ͬ̀͂ͨͫ͘͝ͳ͆ͺ̷̞̖ͮͮ̈̈́̋̀̆̈̾;̫̜͙ͅ\\̛̜̲̑ͪ̏ͬ̀̀ͮͩ͘;̶̻̱ͻ̵̢̡̛̙ͭ̍ͬ\u000bͽ̂̔ͷ͝Ϳ͎̳̓̚ͷ̴̧͇͙̩͎͇̹͓̳͚͓̏ͩ͗̿̄͂́ͧ͗͊̇̈ͥ͒ͫͭ̌̀̀̏̔ͤ͝͞͝ͅ\u0016̤̽̈́ͻ́ͣͿ̌̇\u0378͙̟̠̱̀ͫͨ͋ͧͧͫ͛̕ͅͷ̄Ͷ͓M̑ͳ͎̘ͥ\u0378͖̺̣̐ͯͱ͖̓\u0378̴̬̞͇̝͚̮̙͐ͫ͑̆̌̇\u0378̘͚͋̑ͧͨ̋ͮ̾ͮͫ̅͠͝ͷ̣͡͡愂洿擥汦剸峋瀟抳捊嘆惩戸帐嶙握搏吆樾棡杖棉慸捂溞冦毞匌崬摘妢垖囱嘣巴恠桢愠氄屣曁咓嘣晌浕壄怸吞朰斖瀀廄悟烼憿峝棕僼傃敹指塽女壮叜姧他伩戀晇吹斯搆促拳乌勯汦坰嬩吨槀浔噈奀兪涭惽拡倭俰曗垲斗懭戎墖坼挒婀欨暨".toCharArray();
                        int length = charArray.length;
                        for (int i = 0; length > i; i++) {
                            char c2 = charArray[i];
                            switch (i % 7) {
                                case 0:
                                    c = '\\';
                                    break;
                                case 1:
                                    c = '=';
                                    break;
                                case 2:
                                    c = 'O';
                                    break;
                                case 3:
                                    c = 'E';
                                    break;
                                case 4:
                                    c = 18;
                                    break;
                                case 5:
                                    c = ')';
                                    break;
                                default:
                                    c = 'g';
                                    break;
                            }
                            charArray[i] = (char) (c ^ c2);
                        }
                        f2x55ceac0b = new String(charArray).intern().toCharArray();
                    }

                    /* renamed from: g̵̢̢̛̛͎͈͚̟͎͖͙͖̗̞̫̠͎͍̘͈͕͖͇̯͐͑̔̊͑͛͑͌͑̀̓͠v̴̧̭̟̳̟͉͎̜̗͍͚̭̙̠͓̝̝̘͇̱͈̊́̆̑̈̽̑͂͒̌̀̓̊̆̆̊̈́̋͐̎̽̇̄͆̅̉̈́̽͆̚̕̕̕̕͜͜f̴̡̡̡̢̗̻̮̬͇̪͓̤̣̰̝̩̲͇̹̪̩̻͎͍͙̼̖͈̥̲̱̈̑͆͊͋̍̎́͆͋͛̈̑̾̇̈́͊͘͝͝͝c̸̡̢̨̨͕̯̝̲̟͍̩̹͍̪̼͖͈͍̺͓͎͎̖̗̠̞̰̻͓͎̟͚̝͙͓̘͇̯̺̞͚̬̓̉̋͗̅̔̈́́̃͌́̇͛͂̏̉̏̉̂͒̍͜v̴̧̭̟̳̟͉͎̜̗͍͚̭̙̠͓̝̝̘͇̱͈̊́̆̑̈̽̑͂͒̌̀̓̊̆̆̊̈́̋͐̎̽̇̄͆̅̉̈́̽͆̚̕̕̕̕͜͜k̶̨̢̡̧̧̛̼̠̺̻̱̪̟͕̻̮̼̲̥̭͚͓͖͙̼̤̠̃̐̑͊͒͛͗̈́͂̾̓̾̎̿̆̅̊̒̈́͐̍̒̉̈́̈́̽͑̄̈́̊̄̒͆̾̎̕̕̚̕͜, reason: contains not printable characters */
                    private static /* bridge */ /* synthetic */ String m1xdeed8047(int i, int i2, String str, int i3, int i4) {
                        "v̴̧̭̟̳̟͉͎̜̗͍͚̭̙̠͓̝̝̘͇̱͈̊́̆̑̈̽̑͂͒̌̀̓̊̆̆̊̈́̋͐̎̽̇̄͆̅̉̈́̽͆̚̕̕̕̕͜͜".length();
                        "ų̴̢̢̨̨̹̩̙͎̝̪͔͖͎͙̙̖̦͍͓͈̰̜͚̤̼̺̯̙͍͖͎̦͔̯̻͚̭̎̾̈́̊͊̇̃̚̚̕ͅz̴̨̧̛̛̛̞̱̗͍̖̰͉̝̯̗̻̰̙̹̺̪̭͇̫̪̫̟̗̖͚̼̩͔̝̥͍̹͈̜̆̉̈́̋̀͐̈́̾̉̀̄̈́̀͗̏͆̾̇̆͑̂̂̔̆̎́̇̕̚͜͜͝͠ơ̸̡̡̛͓̰̖͉̤͉̖͔̰͍̤̠̠̱̫͎̭̩͖̻̞̼͓̞͋͐́̉͑̿́͋̌̂̀͊͛̀̄̊͊̓̄͘̚̕̕͜͝͝ͅͅ".length();
                        "ų̴̢̢̨̨̹̩̙͎̝̪͔͖͎͙̙̖̦͍͓͈̰̜͚̤̼̺̯̙͍͖͎̦͔̯̻͚̭̎̾̈́̊͊̇̃̚̚̕ͅf̴̡̡̡̢̗̻̮̬͇̪͓̤̣̰̝̩̲͇̹̪̩̻͎͍͙̼̖͈̥̲̱̈̑͆͊͋̍̎́͆͋͛̈̑̾̇̈́͊͘͝͝͝k̶̨̢̡̧̧̛̼̠̺̻̱̪̟͕̻̮̼̲̥̭͚͓͖͙̼̤̠̃̐̑͊͒͛͗̈́͂̾̓̾̎̿̆̅̊̒̈́͐̍̒̉̈́̈́̽͑̄̈́̊̄̒͆̾̎̕̕̚̕͜".length();
                        "f̴̡̡̡̢̗̻̮̬͇̪͓̤̣̰̝̩̲͇̹̪̩̻͎͍͙̼̖͈̥̲̱̈̑͆͊͋̍̎́͆͋͛̈̑̾̇̈́͊͘͝͝͝k̶̨̢̡̧̧̛̼̠̺̻̱̪̟͕̻̮̼̲̥̭͚͓͖͙̼̤̠̃̐̑͊͒͛͗̈́͂̾̓̾̎̿̆̅̊̒̈́͐̍̒̉̈́̈́̽͑̄̈́̊̄̒͆̾̎̕̕̚̕͜".length();
                        StringBuilder sb = new StringBuilder();
                        char[] charArray = str.toCharArray();
                        "k̶̨̢̡̧̧̛̼̠̺̻̱̪̟͕̻̮̼̲̥̭͚͓͖͙̼̤̠̃̐̑͊͒͛͗̈́͂̾̓̾̎̿̆̅̊̒̈́͐̍̒̉̈́̈́̽͑̄̈́̊̄̒͆̾̎̕̕̚̕͜k̶̨̢̡̧̧̛̼̠̺̻̱̪̟͕̻̮̼̲̥̭͚͓͖͙̼̤̠̃̐̑͊͒͛͗̈́͂̾̓̾̎̿̆̅̊̒̈́͐̍̒̉̈́̈́̽͑̄̈́̊̄̒͆̾̎̕̕̚̕͜a̸̧̻̭̥̩̮̲̝̹̩͍͚̤͈̠̭͓̜̬̭̥͊͗̓̅͋̉͐̿̐̇̑̓̎̒̔̏̇̃̉̂̾͂͋̌̑̀̾̈́̔̊̓̂́̕̕͘͜͠͠͠͠͝".length();
                        "".length();
                        "ȟ̸̡̢̨͍͚̝̲̝̫̟̲͎̲̼̬̦͓̺̭̼̪̜̠͈̭̗̳̳̣͓̟̲̻̜͇̰̞̝̾͂͌̈́̎́́̔̈́͋̀̿̀̍̈́͆͊̔̿͊̅̓́̈́̆̃̽͛̋͂̄̓̌̂͆̚͜͜͝͝͝͠͝ų̴̢̢̨̨̹̩̙͎̝̪͔͖͎͙̙̖̦͍͓͈̰̜͚̤̼̺̯̙͍͖͎̦͔̯̻͚̭̎̾̈́̊͊̇̃̚̚̕ͅl̶̛͙͖͖͙̻̪̦͚͓̖̳̤͙͖̭͖͖̘̠̠͉̲̬͎̫̼̗̹̪͉͚̫̗͍͉͍̹͕̻̯̰̏͌̊̆̒̈́̍̀́̽̾̎̃̒́̆̽̂̄̆̕͝".length();
                        int length = charArray.length;
                        int i5 = 0;
                        int i6 = 0;
                        while (i5 < length) {
                            sb.append((char) ((((charArray[i5] ^ f2x55ceac0b[i6 % f2x55ceac0b.length]) ^ ((i3 + i6) ^ i)) ^ i2) ^ i4));
                            "w̶̢̪̤̫̱̩̣͕̱͓̩͓̩̱̞̯͉͔̺̙͇̝̹̻̯̮͔̰̙̾̏̑̑͗̅͆͂͊͛̒͐̓̈́̃͂́͜͠͝ȟ̸̡̢̨͍͚̝̲̝̫̟̲͎̲̼̬̦͓̺̭̼̪̜̠͈̭̗̳̳̣͓̟̲̻̜͇̰̞̝̾͂͌̈́̎́́̔̈́͋̀̿̀̍̈́͆͊̔̿͊̅̓́̈́̆̃̽͛̋͂̄̓̌̂͆̚͜͜͝͝͝͠͝a̸̧̻̭̥̩̮̲̝̹̩͍͚̤͈̠̭͓̜̬̭̥͊͗̓̅͋̉͐̿̐̇̑̓̎̒̔̏̇̃̉̂̾͂͋̌̑̀̾̈́̔̊̓̂́̕̕͘͜͠͠͠͠͝z̴̨̧̛̛̛̞̱̗͍̖̰͉̝̯̗̻̰̙̹̺̪̭͇̫̪̫̟̗̖͚̼̩͔̝̥͍̹͈̜̆̉̈́̋̀͐̈́̾̉̀̄̈́̀͗̏͆̾̇̆͑̂̂̔̆̎́̇̕̚͜͜͝͠".length();
                            "f̴̡̡̡̢̗̻̮̬͇̪͓̤̣̰̝̩̲͇̹̪̩̻͎͍͙̼̖͈̥̲̱̈̑͆͊͋̍̎́͆͋͛̈̑̾̇̈́͊͘͝͝͝".length();
                            "a̸̧̻̭̥̩̮̲̝̹̩͍͚̤͈̠̭͓̜̬̭̥͊͗̓̅͋̉͐̿̐̇̑̓̎̒̔̏̇̃̉̂̾͂͋̌̑̀̾̈́̔̊̓̂́̕̕͘͜͠͠͠͠͝l̶̛͙͖͖͙̻̪̦͚͓̖̳̤͙͖̭͖͖̘̠̠͉̲̬͎̫̼̗̹̪͉͚̫̗͍͉͍̹͕̻̯̰̏͌̊̆̒̈́̍̀́̽̾̎̃̒́̆̽̂̄̆̕͝ȩ̵̛̛̹̱̳̝̱̝̌̊̓̍̋̃͐̂̌͌̔̈́̊̋̔͑̍́͋͆͛̏̑͒͐̃́͝͠͝ͅb̶̢̛͚̝̰̺̱̲͖̠̘͚͕͉͇̭̗͇̙̗̣͍̲͖̽͗̐̅̾̅́͌̂̚͘͝".length();
                            i5++;
                            i6++;
                        }
                        return sb.toString();
                    }

                    protected /* bridge */ /* synthetic */ void beforeHookedMethod(XC_MethodHook.MethodHookParam methodHookParam) throws Throwable {
                        HookInit.g((Activity) methodHookParam.thisObject);
                    }
                };
                XposedHelpers.findAndHookMethod(m0xbb4d8ad5, classLoader3, m0xbb4d8ad6, objArr);
                "ų̴̢̢̨̨̹̩̙͎̝̪͔͖͎͙̙̖̦͍͓͈̰̜͚̤̼̺̯̙͍͖͎̦͔̯̻͚̭̎̾̈́̊͊̇̃̚̚̕ͅ".length();
                "g̵̢̢̛̛͎͈͚̟͎͖͙͖̗̞̫̠͎͍̘͈͕͖͇̯͐͑̔̊͑͛͑͌͑̀̓͠ŗ̶̢̢̛̛͇͉͍̪̳̟̞͔̥̣̞̙̩̬̻̱͉͚̭̲̭̫̩̘̺͇̬̱̰͍̖͕͎͎̺̻̪̑͌̋̊̿̆̊͛̅̔̊͛̑̍́͊̐̾͘͜͠͠ͅͅ".length();
                "b̶̢̛͚̝̰̺̱̲͖̠̘͚͕͉͇̭̗͇̙̗̣͍̲͖̽͗̐̅̾̅́͌̂̚͘͝g̵̢̢̛̛͎͈͚̟͎͖͙͖̗̞̫̠͎͍̘͈͕͖͇̯͐͑̔̊͑͛͑͌͑̀̓͠b̶̢̛͚̝̰̺̱̲͖̠̘͚͕͉͇̭̗͇̙̗̣͍̲͖̽͗̐̅̾̅́͌̂̚͘͝n̷̢̡̛͕̟͚͙̳̯͇͍͍͙̙͕̲͎͚̦̳͕̱͕̺̱̬͓̖̠̻͎̜̮̥̝̼̋̈́͑͑̾̅̾̐̿".length();
                String m0xbb4d8ad7 = m0xbb4d8ad(1161863229, 481608123, "ᐽᝁ\u173bᝫᝰᝲᜫᝫ\u177d\u177cᜍᝋᝋᝌᝠᝍᝄᝲ\u173d\u1739ᜁᝃᝀ\u175dᝍ\u171d\u1776\u1774ᜆᝤᜄᜤᜏᑟᜤ\u1718ᝏ", -244601683, 884463923);
                ClassLoader classLoader4 = loadPackageParam.classLoader;
                String m0xbb4d8ad8 = m0xbb4d8ad(-778445441, 83244118, "岈念徠從忛忑徝忀", 1093301927, 1644020527);
                Object[] objArr2 = new Object[2];
                "ȩ̵̛̛̹̱̳̝̱̝̌̊̓̍̋̃͐̂̌͌̔̈́̊̋̔͑̍́͋͆͛̏̑͒͐̃́͝͠͝ͅg̵̢̢̛̛͎͈͚̟͎͖͙͖̗̞̫̠͎͍̘͈͕͖͇̯͐͑̔̊͑͛͑͌͑̀̓͠ȟ̸̡̢̨͍͚̝̲̝̫̟̲͎̲̼̬̦͓̺̭̼̪̜̠͈̭̗̳̳̣͓̟̲̻̜͇̰̞̝̾͂͌̈́̎́́̔̈́͋̀̿̀̍̈́͆͊̔̿͊̅̓́̈́̆̃̽͛̋͂̄̓̌̂͆̚͜͜͝͝͝͠͝a̸̧̻̭̥̩̮̲̝̹̩͍͚̤͈̠̭͓̜̬̭̥͊͗̓̅͋̉͐̿̐̇̑̓̎̒̔̏̇̃̉̂̾͂͋̌̑̀̾̈́̔̊̓̂́̕̕͘͜͠͠͠͠͝".length();
                "ẙ̵̡̖͚̫̘̩͇͉͔̖͍̹͈̘͕̥͎̻̘͖̲̲͔̦͎̣͖͈̯̹̈́̓̋̈́̋̓͆̒̔̈́̒̎́̏̀͊̅̆̇͝͠͠ͅ".length();
                "s̷̢̧̲̱̳̖̬͙̱͕̮̩̺̣̪̼͔̮͚͓͇͓̲̣̥͇̬̪̹̞̼̣͌͊̄̏̅̇̾͜͠ͅ".length();
                try {
                    objArr2[0] = Class.forName(m0xbb4d8ad(967603412, 1117851934, "菆肹胋胖肙肕胁胛肇肓胴肙股肷肇肷肱", 708891945, 72102658));
                    "l̶̛͙͖͖͙̻̪̦͚͓̖̳̤͙͖̭͖͖̘̠̠͉̲̬͎̫̼̗̹̪͉͚̫̗͍͉͍̹͕̻̯̰̏͌̊̆̒̈́̍̀́̽̾̎̃̒́̆̽̂̄̆̕͝s̷̢̧̲̱̳̖̬͙̱͕̮̩̺̣̪̼͔̮͚͓͇͓̲̣̥͇̬̪̹̞̼̣͌͊̄̏̅̇̾͜͠ͅf̴̡̡̡̢̗̻̮̬͇̪͓̤̣̰̝̩̲͇̹̪̩̻͎͍͙̼̖͈̥̲̱̈̑͆͊͋̍̎́͆͋͛̈̑̾̇̈́͊͘͝͝͝b̶̢̛͚̝̰̺̱̲͖̠̘͚͕͉͇̭̗͇̙̗̣͍̲͖̽͗̐̅̾̅́͌̂̚͘͝".length();
                    "c̸̡̢̨̨͕̯̝̲̟͍̩̹͍̪̼͖͈͍̺͓͎͎̖̗̠̞̰̻͓͎̟͚̝͙͓̘͇̯̺̞͚̬̓̉̋͗̅̔̈́́̃͌́̇͛͂̏̉̏̉̂͒̍͜ȩ̵̛̛̹̱̳̝̱̝̌̊̓̍̋̃͐̂̌͌̔̈́̊̋̔͑̍́͋͆͛̏̑͒͐̃́͝͠͝ͅȩ̵̛̛̹̱̳̝̱̝̌̊̓̍̋̃͐̂̌͌̔̈́̊̋̔͑̍́͋͆͛̏̑͒͐̃́͝͠͝ͅȩ̵̛̛̹̱̳̝̱̝̌̊̓̍̋̃͐̂̌͌̔̈́̊̋̔͑̍́͋͆͛̏̑͒͐̃́͝͠͝ͅ".length();
                    "ơ̸̡̡̛͓̰̖͉̤͉̖͔̰͍̤̠̠̱̫͎̭̩͖̻̞̼͓̞͋͐́̉͑̿́͋̌̂̀͊͛̀̄̊͊̓̄͘̚̕̕͜͝͝ͅͅc̸̡̢̨̨͕̯̝̲̟͍̩̹͍̪̼͖͈͍̺͓͎͎̖̗̠̞̰̻͓͎̟͚̝͙͓̘͇̯̺̞͚̬̓̉̋͗̅̔̈́́̃͌́̇͛͂̏̉̏̉̂͒̍͜c̸̡̢̨̨͕̯̝̲̟͍̩̹͍̪̼͖͈͍̺͓͎͎̖̗̠̞̰̻͓͎̟͚̝͙͓̘͇̯̺̞͚̬̓̉̋͗̅̔̈́́̃͌́̇͛͂̏̉̏̉̂͒̍͜".length();
                    "ẙ̵̡̖͚̫̘̩͇͉͔̖͍̹͈̘͕̥͎̻̘͖̲̲͔̦͎̣͖͈̯̹̈́̓̋̈́̋̓͆̒̔̈́̒̎́̏̀͊̅̆̇͝͠͠ͅw̶̢̪̤̫̱̩̣͕̱͓̩͓̩̱̞̯͉͔̺̙͇̝̹̻̯̮͔̰̙̾̏̑̑͗̅͆͂͊͛̒͐̓̈́̃͂́͜͠͝b̶̢̛͚̝̰̺̱̲͖̠̘͚͕͉͇̭̗͇̙̗̣͍̲͖̽͗̐̅̾̅́͌̂̚͘͝".length();
                    objArr2[1] = new XC_MethodHook() { // from class: com.brazzers.aio.HookInit.100000001

                        /* renamed from: F̵̡̧̧̩̜̫̥̝̙̫̘͇̘͍͙̝̪͈̞͚̙̩̞͌̀̓͂̍̑̚̚R̷̨̢̛̖̦̺̻͕̜̪̥̣̮̘̱̉͒͊͋̇͒̇͌̂̂͋̂͋͒̂̐̔͋͌̔̈́͆̒͒̑̿̆͑̿̑̋͒̊̔̏͠͠͠1̵̡̢͈̙͙͍̞̯̪̤̫̦͕͓͍̹̳̞̳̮͓̼͑̄͐̀̕͝Ë̴̢̧̧̡̡̢̧̛̛̠̖̲̘͙͇̤̺͓͖̗̞͖̞̣̮̮͚̦͓͍͖͚̣͙͍̬̞̙̙̖͓̜̽̇̀̉͂̾̓̈́͂́̾͗̽͐ͅͅŅ̸̧̢̧̲̣͙̠̩̲̦̦̻̩̟͖̤͈̲̰̜̍̄ͅD̸̢̧̛̛͖̖̞̩͓̩̫̐̽̐́͂́̆̈̐̀͋̎̎̋̂͋̇̓̀̀̋̉́̂̐̏̎̒̀͌̽̎̚͘̚͠͠Ş̶̢̣̼̬̺̞̮̟̜͖̖̭͙͎̻͖͚͚̲̘̼̫̹̹̖̔_̸̨͉̞̮̟̗̬̭̙͇͙̲̥̯̮͈̬̺̫̞̮̤̔̒͗̽̈́̓̈́͌͒̾̆̈́͑͋̌̉͑̂̏͂̽̍̓͘͜Ë̴̢̧̧̡̡̢̧̛̛̠̖̲̘͙͇̤̺͓͖̗̞͖̞̣̮̮͚̦͓͍͖͚̣͙͍̬̞̙̙̖͓̜̽̇̀̉͂̾̓̈́͂́̾͗̽͐ͅͅ, reason: contains not printable characters */
                        static /* synthetic */ char[] f4xd9380737;

                        /* renamed from: F̵̡̧̧̩̜̫̥̝̙̫̘͇̘͍͙̝̪͈̞͚̙̩̞͌̀̓͂̍̑̚̚R̷̨̢̛̖̦̺̻͕̜̪̥̣̮̘̱̉͒͊͋̇͒̇͌̂̂͋̂͋͒̂̐̔͋͌̔̈́͆̒͒̑̿̆͑̿̑̋͒̊̔̏͠͠͠1̵̡̢͈̙͙͍̞̯̪̤̫̦͕͓͍̹̳̞̳̮͓̼͑̄͐̀̕͝Ë̴̢̧̧̡̡̢̧̛̛̠̖̲̘͙͇̤̺͓͖̗̞͖̞̣̮̮͚̦͓͍͖͚̣͙͍̬̞̙̙̖͓̜̽̇̀̉͂̾̓̈́͂́̾͗̽͐ͅͅŅ̸̧̢̧̲̣͙̠̩̲̦̦̻̩̟͖̤͈̲̰̜̍̄ͅD̸̢̧̛̛͖̖̞̩͓̩̫̐̽̐́͂́̆̈̐̀͋̎̎̋̂͋̇̓̀̀̋̉́̂̐̏̎̒̀͌̽̎̚͘̚͠͠Ş̶̢̣̼̬̺̞̮̟̜͖̖̭͙͎̻͖͚͚̲̘̼̫̹̹̖̔_̸̨͉̞̮̟̗̬̭̙͇͙̲̥̯̮͈̬̺̫̞̮̤̔̒͗̽̈́̓̈́͌͒̾̆̈́͑͋̌̉͑̂̏͂̽̍̓͘͜ẙ̵̡̖͚̫̘̩͇͉͔̖͍̹͈̘͕̥͎̻̘͖̲̲͔̦͎̣͖͈̯̹̈́̓̋̈́̋̓͆̒̔̈́̒̎́̏̀͊̅̆̇͝͠͠ͅp̸̨̩̤̥̜͔͕̙̲͍͚̮̩͉͎͓̣̗͕̽̉͛͑̀̏̿̾̿̏̾̋͋͊̋́̈́̊̈́͗̃̃̅̈́̇̏̂͑̊̚͝͠f̴̡̡̡̢̗̻̮̬͇̪͓̤̣̰̝̩̲͇̹̪̩̻͎͍͙̼̖͈̥̲̱̈̑͆͊͋̍̎́͆͋͛̈̑̾̇̈́͊͘͝͝͝i̷̢̡̡̢̢̨̹͓̼̦̣͇̖͇͕̬̠̖̗̞̝͖̤̮̠̩̰̰̭̱̟̞͈̫͉̔̽̌̓̏͜͝ͅm̵̡̫̙͔̜͙͇͈̝̲̱͕̱̤̟̭̭̙̠͎̬̦͇͎͙͓̰̣̻̥̦̒͊̎̈́̾̾̾͒̃͂͐̉̎̌͂̀͒͗͒̇́̀͛̌́͊̓̈́̀́̀̂̀̕̚̚̚͜͝͝͝͝͝͠͝ŗ̶̢̢̛̛͇͉͍̪̳̟̞͔̥̣̞̙̩̬̻̱͉͚̭̲̭̫̩̘̺͇̬̱̰͍̖͕͎͎̺̻̪̑͌̋̊̿̆̊͛̅̔̊͛̑̍́͊̐̾͘͜͠͠ͅͅq̸͍̟͍͕̹͉̤̱̏̆͗́̈́̓̈̆̊͝͝͝i̷̢̡̡̢̢̨̹͓̼̦̣͇̖͇͕̬̠̖̗̞̝͖̤̮̠̩̰̰̭̱̟̞͈̫͉̔̽̌̓̏͜͝ͅn̷̢̡̛͕̟͚͙̳̯͇͍͍͙̙͕̲͎͚̦̳͕̱͕̺̱̬͓̖̠̻͎̜̮̥̝̼̋̈́͑͑̾̅̾̐̿z̴̨̧̛̛̛̞̱̗͍̖̰͉̝̯̗̻̰̙̹̺̪̭͇̫̪̫̟̗̖͚̼̩͔̝̥͍̹͈̜̆̉̈́̋̀͐̈́̾̉̀̄̈́̀͗̏͆̾̇̆͑̂̂̔̆̎́̇̕̚͜͜͝͠b̶̢̛͚̝̰̺̱̲͖̠̘͚͕͉͇̭̗͇̙̗̣͍̲͖̽͗̐̅̾̅́͌̂̚͘͝ų̴̢̢̨̨̹̩̙͎̝̪͔͖͎͙̙̖̦͍͓͈̰̜͚̤̼̺̯̙͍͖͎̦͔̯̻͚̭̎̾̈́̊͊̇̃̚̚̕ͅ, reason: contains not printable characters */
                        static final int f5x39aebd3b = 0;

                        static {
                            char c;
                            char[] charArray = "H̱́̅Ͷ̨̗̮̯͛͋̃ͤ͂ͨ̒̕͘ͼ͉̜̜ͪ̑̀\u0378ͫ́̐̔ͬ͞ͻ\u0013̴͖͇̙̩͕͍͈̖͔͚͇͚̙͍̯͙̾̇̎̓̎͂̆̏̎ͧ̊͛̌̔̎ͩͮͤ͐̂̎͊͗̿͘͢͟͜͜͞͏̪̠̜̼ͤͧTʹ̶̶̨͔̘̘̗̭̬̯̫̰̊ͥ̉̀͛͊ͫ̐̌̽̾ͫ͘̚͝ͽĽ̺̰̥͈̰̗͉͂͋̇;̷̢̧̨̨̧̛͙̹͇̟̼̜͈̜̳̳̮̪̬̳̮͔͔͉̗͙̀ͥ͒͛̄̐ͫ͋͗̈ͣ̈̐̒̚͟͝͞͡͝͞+\u0379̶̢̮̜̮̼̫̄̊ͨͅ;̩̠̯͌̍͂͟͞ͳ̘͌̾Iͽ͵ͼ̙̙͍̮̏͆̌̓ͭ͛ͤ̕͞͏̇̅̆͆͂Ͷ͇̟́̉̅̍̌̽͑ͩ́̊ͅͿ̴̯͓̍̀͒ͻ̮̭̦ͨ͝\u0016̸̡͓͕̪̩Ϳͻ̵̵̴̛̖̼̫̟͙̥͓ͯ̒͒ͨ̏͒͗͗̽:\u0379̝̜͚͜\u0378̴̡̡͍͖̳͇̗̙͒͂̓̐͂̂̍ͪ̃̃̈́͜ͻ̨̖̙̥ͯͨͼ̡̢̼̭̳̥̣̆͐ͫͭ̚͡吻劶傾塨嵗亏夢映当師兹摬唨媙愞滑儻姣吀廝儤彣捝塍故杵洁俶咏晽氼暒懃卮峫毨勹廢欈倱攍攖帓囙棗焔危傣憆报娿嬨灺噂侽兄捇儸揅愓懯僱洦敛昧塮寵垔橎溲桛楨剀峁渂惑戠嗱挤憞庼晋屓抟瀻唠宇搤佂柱滌涌帶氅泻吉壴槵帏塭沌".toCharArray();
                            int length = charArray.length;
                            for (int i = 0; length > i; i++) {
                                char c2 = charArray[i];
                                switch (i % 7) {
                                    case 0:
                                        c = 14;
                                        break;
                                    case 1:
                                        c = 4;
                                        break;
                                    case 2:
                                        c = '\r';
                                        break;
                                    case 3:
                                        c = 'E';
                                        break;
                                    case 4:
                                        c = 'e';
                                        break;
                                    case 5:
                                        c = 'A';
                                        break;
                                    default:
                                        c = '\t';
                                        break;
                                }
                                charArray[i] = (char) (c ^ c2);
                            }
                            f4xd9380737 = new String(charArray).intern().toCharArray();
                        }

                        /* renamed from: v̴̧̭̟̳̟͉͎̜̗͍͚̭̙̠͓̝̝̘͇̱͈̊́̆̑̈̽̑͂͒̌̀̓̊̆̆̊̈́̋͐̎̽̇̄͆̅̉̈́̽͆̚̕̕̕̕͜͜m̵̡̫̙͔̜͙͇͈̝̲̱͕̱̤̟̭̭̙̠͎̬̦͇͎͙͓̰̣̻̥̦̒͊̎̈́̾̾̾͒̃͂͐̉̎̌͂̀͒͗͒̇́̀͛̌́͊̓̈́̀́̀̂̀̕̚̚̚͜͝͝͝͝͝͠͝k̶̨̢̡̧̧̛̼̠̺̻̱̪̟͕̻̮̼̲̥̭͚͓͖͙̼̤̠̃̐̑͊͒͛͗̈́͂̾̓̾̎̿̆̅̊̒̈́͐̍̒̉̈́̈́̽͑̄̈́̊̄̒͆̾̎̕̕̚̕͜z̴̨̧̛̛̛̞̱̗͍̖̰͉̝̯̗̻̰̙̹̺̪̭͇̫̪̫̟̗̖͚̼̩͔̝̥͍̹͈̜̆̉̈́̋̀͐̈́̾̉̀̄̈́̀͗̏͆̾̇̆͑̂̂̔̆̎́̇̕̚͜͜͝͠c̸̡̢̨̨͕̯̝̲̟͍̩̹͍̪̼͖͈͍̺͓͎͎̖̗̠̞̰̻͓͎̟͚̝͙͓̘͇̯̺̞͚̬̓̉̋͗̅̔̈́́̃͌́̇͛͂̏̉̏̉̂͒̍͜q̸͍̟͍͕̹͉̤̱̏̆͗́̈́̓̈̆̊͝͝͝, reason: contains not printable characters */
                        private static /* bridge */ /* synthetic */ String m2x5dd56ca2(int i, int i2, String str, int i3, int i4) {
                            "ơ̸̡̡̛͓̰̖͉̤͉̖͔̰͍̤̠̠̱̫͎̭̩͖̻̞̼͓̞͋͐́̉͑̿́͋̌̂̀͊͛̀̄̊͊̓̄͘̚̕̕͜͝͝ͅͅx̴̧̨̨͖̤͙͓͎͎̞͖̮̲̦͖̦̞̘͔̩͓̦̭͍̣͉̹̯͔̖̖͐́͂̉a̸̧̻̭̥̩̮̲̝̹̩͍͚̤͈̠̭͓̜̬̭̥͊͗̓̅͋̉͐̿̐̇̑̓̎̒̔̏̇̃̉̂̾͂͋̌̑̀̾̈́̔̊̓̂́̕̕͘͜͠͠͠͠͝q̸͍̟͍͕̹͉̤̱̏̆͗́̈́̓̈̆̊͝͝͝".length();
                            "".length();
                            StringBuilder sb = new StringBuilder();
                            char[] charArray = str.toCharArray();
                            "".length();
                            "p̸̨̩̤̥̜͔͕̙̲͍͚̮̩͉͎͓̣̗͕̽̉͛͑̀̏̿̾̿̏̾̋͋͊̋́̈́̊̈́͗̃̃̅̈́̇̏̂͑̊̚͝͠ų̴̢̢̨̨̹̩̙͎̝̪͔͖͎͙̙̖̦͍͓͈̰̜͚̤̼̺̯̙͍͖͎̦͔̯̻͚̭̎̾̈́̊͊̇̃̚̚̕ͅ".length();
                            "p̸̨̩̤̥̜͔͕̙̲͍͚̮̩͉͎͓̣̗͕̽̉͛͑̀̏̿̾̿̏̾̋͋͊̋́̈́̊̈́͗̃̃̅̈́̇̏̂͑̊̚͝͠".length();
                            int length = charArray.length;
                            int i5 = 0;
                            int i6 = 0;
                            while (i5 < length) {
                                sb.append((char) ((((charArray[i5] ^ f4xd9380737[i6 % f4xd9380737.length]) ^ ((i3 + i6) ^ i)) ^ i2) ^ i4));
                                "ẙ̵̡̖͚̫̘̩͇͉͔̖͍̹͈̘͕̥͎̻̘͖̲̲͔̦͎̣͖͈̯̹̈́̓̋̈́̋̓͆̒̔̈́̒̎́̏̀͊̅̆̇͝͠͠ͅ".length();
                                "".length();
                                "k̶̨̢̡̧̧̛̼̠̺̻̱̪̟͕̻̮̼̲̥̭͚͓͖͙̼̤̠̃̐̑͊͒͛͗̈́͂̾̓̾̎̿̆̅̊̒̈́͐̍̒̉̈́̈́̽͑̄̈́̊̄̒͆̾̎̕̕̚̕͜z̴̨̧̛̛̛̞̱̗͍̖̰͉̝̯̗̻̰̙̹̺̪̭͇̫̪̫̟̗̖͚̼̩͔̝̥͍̹͈̜̆̉̈́̋̀͐̈́̾̉̀̄̈́̀͗̏͆̾̇̆͑̂̂̔̆̎́̇̕̚͜͜͝͠x̴̧̨̨͖̤͙͓͎͎̞͖̮̲̦͖̦̞̘͔̩͓̦̭͍̣͉̹̯͔̖̖͐́͂̉".length();
                                i5++;
                                i6++;
                            }
                            return sb.toString();
                        }

                        protected /* bridge */ /* synthetic */ void afterHookedMethod(XC_MethodHook.MethodHookParam methodHookParam) throws Throwable {
                            ((Activity) methodHookParam.thisObject).finish();
                            methodHookParam.setResult((Object) null);
                        }
                    };
                    XposedHelpers.findAndHookMethod(m0xbb4d8ad7, classLoader4, m0xbb4d8ad8, objArr2);
                    "ḋ̴̡̯̱̞͈̦̯͍̩̯͌̀̑̓̔̈́̅̓͋̃͂̈́̈́͆́̄̓́̄̚̕̚͝q̸͍̟͍͕̹͉̤̱̏̆͗́̈́̓̈̆̊͝͝͝l̶̛͙͖͖͙̻̪̦͚͓̖̳̤͙͖̭͖͖̘̠̠͉̲̬͎̫̼̗̹̪͉͚̫̗͍͉͍̹͕̻̯̰̏͌̊̆̒̈́̍̀́̽̾̎̃̒́̆̽̂̄̆̕͝".length();
                    "a̸̧̻̭̥̩̮̲̝̹̩͍͚̤͈̠̭͓̜̬̭̥͊͗̓̅͋̉͐̿̐̇̑̓̎̒̔̏̇̃̉̂̾͂͋̌̑̀̾̈́̔̊̓̂́̕̕͘͜͠͠͠͠͝".length();
                    "ȟ̸̡̢̨͍͚̝̲̝̫̟̲͎̲̼̬̦͓̺̭̼̪̜̠͈̭̗̳̳̣͓̟̲̻̜͇̰̞̝̾͂͌̈́̎́́̔̈́͋̀̿̀̍̈́͆͊̔̿͊̅̓́̈́̆̃̽͛̋͂̄̓̌̂͆̚͜͜͝͝͝͠͝v̴̧̭̟̳̟͉͎̜̗͍͚̭̙̠͓̝̝̘͇̱͈̊́̆̑̈̽̑͂͒̌̀̓̊̆̆̊̈́̋͐̎̽̇̄͆̅̉̈́̽͆̚̕̕̕̕͜͜".length();
                    String m0xbb4d8ad9 = m0xbb4d8ad(1837697394, 2052136020, "⋩↗⇳↽↢↻⇤↶↪↹→→⇟↟↦ↂ←↥\u218c⇦↹⇖\u218e⇦⇒\u218e↩⇍↰⇆↛↪ↁ⋜↷↟⇇⇕⇼↓⇒↛⇀←\u218e⇋", -1080884722, -1603717660);
                    ClassLoader classLoader5 = loadPackageParam.classLoader;
                    String m0xbb4d8ad10 = m0xbb4d8ad(-1959593319, 482998931, "ፐအၴ၎ဋစ၉ဈ", 632296393, 1471021242);
                    Object[] objArr3 = new Object[2];
                    "b̶̢̛͚̝̰̺̱̲͖̠̘͚͕͉͇̭̗͇̙̗̣͍̲͖̽͗̐̅̾̅́͌̂̚͘͝g̵̢̢̛̛͎͈͚̟͎͖͙͖̗̞̫̠͎͍̘͈͕͖͇̯͐͑̔̊͑͛͑͌͑̀̓͠".length();
                    try {
                        objArr3[0] = Class.forName(m0xbb4d8ad(860414726, -1940936262, "⍥„\u206c⁵››\u206e\u2068‴․⁃\u202a‒‘\u2028—‒", -2031486685, 25661661));
                        "m̵̡̫̙͔̜͙͇͈̝̲̱͕̱̤̟̭̭̙̠͎̬̦͇͎͙͓̰̣̻̥̦̒͊̎̈́̾̾̾͒̃͂͐̉̎̌͂̀͒͗͒̇́̀͛̌́͊̓̈́̀́̀̂̀̕̚̚̚͜͝͝͝͝͝͠͝ơ̸̡̡̛͓̰̖͉̤͉̖͔̰͍̤̠̠̱̫͎̭̩͖̻̞̼͓̞͋͐́̉͑̿́͋̌̂̀͊͛̀̄̊͊̓̄͘̚̕̕͜͝͝ͅͅ".length();
                        "".length();
                        "ẙ̵̡̖͚̫̘̩͇͉͔̖͍̹͈̘͕̥͎̻̘͖̲̲͔̦͎̣͖͈̯̹̈́̓̋̈́̋̓͆̒̔̈́̒̎́̏̀͊̅̆̇͝͠͠ͅa̸̧̻̭̥̩̮̲̝̹̩͍͚̤͈̠̭͓̜̬̭̥͊͗̓̅͋̉͐̿̐̇̑̓̎̒̔̏̇̃̉̂̾͂͋̌̑̀̾̈́̔̊̓̂́̕̕͘͜͠͠͠͠͝s̷̢̧̲̱̳̖̬͙̱͕̮̩̺̣̪̼͔̮͚͓͇͓̲̣̥͇̬̪̹̞̼̣͌͊̄̏̅̇̾͜͠ͅơ̸̡̡̛͓̰̖͉̤͉̖͔̰͍̤̠̠̱̫͎̭̩͖̻̞̼͓̞͋͐́̉͑̿́͋̌̂̀͊͛̀̄̊͊̓̄͘̚̕̕͜͝͝ͅͅ".length();
                        "f̴̡̡̡̢̗̻̮̬͇̪͓̤̣̰̝̩̲͇̹̪̩̻͎͍͙̼̖͈̥̲̱̈̑͆͊͋̍̎́͆͋͛̈̑̾̇̈́͊͘͝͝͝ȟ̸̡̢̨͍͚̝̲̝̫̟̲͎̲̼̬̦͓̺̭̼̪̜̠͈̭̗̳̳̣͓̟̲̻̜͇̰̞̝̾͂͌̈́̎́́̔̈́͋̀̿̀̍̈́͆͊̔̿͊̅̓́̈́̆̃̽͛̋͂̄̓̌̂͆̚͜͜͝͝͝͠͝".length();
                        "".length();
                        "s̷̢̧̲̱̳̖̬͙̱͕̮̩̺̣̪̼͔̮͚͓͇͓̲̣̥͇̬̪̹̞̼̣͌͊̄̏̅̇̾͜͠ͅc̸̡̢̨̨͕̯̝̲̟͍̩̹͍̪̼͖͈͍̺͓͎͎̖̗̠̞̰̻͓͎̟͚̝͙͓̘͇̯̺̞͚̬̓̉̋͗̅̔̈́́̃͌́̇͛͂̏̉̏̉̂͒̍͜z̴̨̧̛̛̛̞̱̗͍̖̰͉̝̯̗̻̰̙̹̺̪̭͇̫̪̫̟̗̖͚̼̩͔̝̥͍̹͈̜̆̉̈́̋̀͐̈́̾̉̀̄̈́̀͗̏͆̾̇̆͑̂̂̔̆̎́̇̕̚͜͜͝͠ẙ̵̡̖͚̫̘̩͇͉͔̖͍̹͈̘͕̥͎̻̘͖̲̲͔̦͎̣͖͈̯̹̈́̓̋̈́̋̓͆̒̔̈́̒̎́̏̀͊̅̆̇͝͠͠ͅ".length();
                        "v̴̧̭̟̳̟͉͎̜̗͍͚̭̙̠͓̝̝̘͇̱͈̊́̆̑̈̽̑͂͒̌̀̓̊̆̆̊̈́̋͐̎̽̇̄͆̅̉̈́̽͆̚̕̕̕̕͜͜b̶̢̛͚̝̰̺̱̲͖̠̘͚͕͉͇̭̗͇̙̗̣͍̲͖̽͗̐̅̾̅́͌̂̚͘͝".length();
                        objArr3[1] = new XC_MethodHook() { // from class: com.brazzers.aio.HookInit.100000002

                            /* renamed from: F̵̡̧̧̩̜̫̥̝̙̫̘͇̘͍͙̝̪͈̞͚̙̩̞͌̀̓͂̍̑̚̚R̷̨̢̛̖̦̺̻͕̜̪̥̣̮̘̱̉͒͊͋̇͒̇͌̂̂͋̂͋͒̂̐̔͋͌̔̈́͆̒͒̑̿̆͑̿̑̋͒̊̔̏͠͠͠1̵̡̢͈̙͙͍̞̯̪̤̫̦͕͓͍̹̳̞̳̮͓̼͑̄͐̀̕͝Ë̴̢̧̧̡̡̢̧̛̛̠̖̲̘͙͇̤̺͓͖̗̞͖̞̣̮̮͚̦͓͍͖͚̣͙͍̬̞̙̙̖͓̜̽̇̀̉͂̾̓̈́͂́̾͗̽͐ͅͅŅ̸̧̢̧̲̣͙̠̩̲̦̦̻̩̟͖̤͈̲̰̜̍̄ͅD̸̢̧̛̛͖̖̞̩͓̩̫̐̽̐́͂́̆̈̐̀͋̎̎̋̂͋̇̓̀̀̋̉́̂̐̏̎̒̀͌̽̎̚͘̚͠͠Ş̶̢̣̼̬̺̞̮̟̜͖̖̭͙͎̻͖͚͚̲̘̼̫̹̹̖̔_̸̨͉̞̮̟̗̬̭̙͇͙̲̥̯̮͈̬̺̫̞̮̤̔̒͗̽̈́̓̈́͌͒̾̆̈́͑͋̌̉͑̂̏͂̽̍̓͘͜P̵̨̨̥̼̫͚͖̣̞͉͎̖̰̠̳̲̫͍̱̻̥̗̥̩̺̗͕̰͈̔̎̂̀̃͑̌̈́̆͗̈̅͗́̇̇̆̎̄̑̇̊̄̂̿̀̓̆͆͌̍̈̉̇̄͋̽̐͆̕͘͝͝͠ͅͅ, reason: contains not printable characters */
                            static /* synthetic */ char[] f6xec147401;

                            /* renamed from: F̵̡̧̧̩̜̫̥̝̙̫̘͇̘͍͙̝̪͈̞͚̙̩̞͌̀̓͂̍̑̚̚R̷̨̢̛̖̦̺̻͕̜̪̥̣̮̘̱̉͒͊͋̇͒̇͌̂̂͋̂͋͒̂̐̔͋͌̔̈́͆̒͒̑̿̆͑̿̑̋͒̊̔̏͠͠͠1̵̡̢͈̙͙͍̞̯̪̤̫̦͕͓͍̹̳̞̳̮͓̼͑̄͐̀̕͝Ë̴̢̧̧̡̡̢̧̛̛̠̖̲̘͙͇̤̺͓͖̗̞͖̞̣̮̮͚̦͓͍͖͚̣͙͍̬̞̙̙̖͓̜̽̇̀̉͂̾̓̈́͂́̾͗̽͐ͅͅŅ̸̧̢̧̲̣͙̠̩̲̦̦̻̩̟͖̤͈̲̰̜̍̄ͅD̸̢̧̛̛͖̖̞̩͓̩̫̐̽̐́͂́̆̈̐̀͋̎̎̋̂͋̇̓̀̀̋̉́̂̐̏̎̒̀͌̽̎̚͘̚͠͠Ş̶̢̣̼̬̺̞̮̟̜͖̖̭͙͎̻͖͚͚̲̘̼̫̹̹̖̔_̸̨͉̞̮̟̗̬̭̙͇͙̲̥̯̮͈̬̺̫̞̮̤̔̒͗̽̈́̓̈́͌͒̾̆̈́͑͋̌̉͑̂̏͂̽̍̓͘͜ȟ̸̡̢̨͍͚̝̲̝̫̟̲͎̲̼̬̦͓̺̭̼̪̜̠͈̭̗̳̳̣͓̟̲̻̜͇̰̞̝̾͂͌̈́̎́́̔̈́͋̀̿̀̍̈́͆͊̔̿͊̅̓́̈́̆̃̽͛̋͂̄̓̌̂͆̚͜͜͝͝͝͠͝c̸̡̢̨̨͕̯̝̲̟͍̩̹͍̪̼͖͈͍̺͓͎͎̖̗̠̞̰̻͓͎̟͚̝͙͓̘͇̯̺̞͚̬̓̉̋͗̅̔̈́́̃͌́̇͛͂̏̉̏̉̂͒̍͜x̴̧̨̨͖̤͙͓͎͎̞͖̮̲̦͖̦̞̘͔̩͓̦̭͍̣͉̹̯͔̖̖͐́͂̉j̴̨̛̦̱̦̮̪̲͖̱͚͈̹̭̊̂͛̍̎̇̽͆̎̔̏̂̉̓̓͌̌̂̓͋̐̒̽̂̿̔̈́͗͘̕͝͝͝͝͝ͅc̸̡̢̨̨͕̯̝̲̟͍̩̹͍̪̼͖͈͍̺͓͎͎̖̗̠̞̰̻͓͎̟͚̝͙͓̘͇̯̺̞͚̬̓̉̋͗̅̔̈́́̃͌́̇͛͂̏̉̏̉̂͒̍͜x̴̧̨̨͖̤͙͓͎͎̞͖̮̲̦͖̦̞̘͔̩͓̦̭͍̣͉̹̯͔̖̖͐́͂̉ȩ̵̛̛̹̱̳̝̱̝̌̊̓̍̋̃͐̂̌͌̔̈́̊̋̔͑̍́͋͆͛̏̑͒͐̃́͝͠͝ͅq̸͍̟͍͕̹͉̤̱̏̆͗́̈́̓̈̆̊͝͝͝k̶̨̢̡̧̧̛̼̠̺̻̱̪̟͕̻̮̼̲̥̭͚͓͖͙̼̤̠̃̐̑͊͒͛͗̈́͂̾̓̾̎̿̆̅̊̒̈́͐̍̒̉̈́̈́̽͑̄̈́̊̄̒͆̾̎̕̕̚̕͜s̷̢̧̲̱̳̖̬͙̱͕̮̩̺̣̪̼͔̮͚͓͇͓̲̣̥͇̬̪̹̞̼̣͌͊̄̏̅̇̾͜͠ͅb̶̢̛͚̝̰̺̱̲͖̠̘͚͕͉͇̭̗͇̙̗̣͍̲͖̽͗̐̅̾̅́͌̂̚͘͝ȩ̵̛̛̹̱̳̝̱̝̌̊̓̍̋̃͐̂̌͌̔̈́̊̋̔͑̍́͋͆͛̏̑͒͐̃́͝͠͝ͅ, reason: contains not printable characters */
                            static final int f7x76aa240 = 0;

                            static {
                                char c;
                                char[] charArray = "@͖̿Ͱ̜ͨ͆̋Ͳͩ̑͜͵\u0379͈͖̭̚͢ͷ͆́ͻ̾ͩͦͶ̖̘̹̙ͪͥ\u000e̱̹ͩ̏ͻͼ͙̎͊͡ͱͻ\u0379̗̌̄ͳͧͻ̷͈̀̚ͱ̡̡̢͚̫͍͕͔͓̈́̾ͦ̃̈́ͩͧ̿͊\u0378̼̦̬͑͘\u0379ͽ̨ͻ͂̒J̳ͩ̏̂ͦͭͻ̔Ϳ̟̺̮͔̾Ͷͺ̵̨̤͈͕ͥ̑ͧͽ̨̞̀͠\u001b̷̸̲͎̻͕̜ͫͰ̷Ͳ̣̫͙͑͠͝͠͞ͼ̴͈ͻ̶̼ͩ\u0378̵͕̮̭̙ͤͤ\u0379̘͔̞͕̀̆Ϳ̠̰͒ͽ̭;\u0379̪̀͜ͽ͇̟͗͂͵̠̬5͓ͤ̂͑͐ͩ͛͵\u0379̴̡͕͇̋͒̓̈͑ͅ\u0378̶̛ͮ͜Ϳ7̡͎̈ͫ̇͡Ͳ̶ͳ̸̷͎̝̳̫̰͆̃͒͐̍ͨ̍ͪ͜͡͞Ͳ̵̲̣̰̦͌̾̉ͭ̐ͣ̈͑ͥ͡͡͵\u0379͕͊͘c͍͈ͽ̡̊ͥ͟͟Ͳ̵̢̝́ͥ̒̚ͼ̵̩͉̭͚̦̽ͪ̈́͊͢$̻̤ͤ͊̔̍̿͏̶̢̱͍̲͊̿̍̊ͪ̚̕ʹ̞ͣ̋Ͱ̺ͬͥͲ́̑͏̴̛̝̞̳͛̇͆͢͜Ͱ̭ͤͽ̔͝卌壠嚻劋斆嚳氫崅崖梲嬘嫏洨婄儁埗棅溗匝毰榈淓忴煜婟慄敤焽唛奂彴擹婱撄娄憾涑柖洂旃丁掗潏婏烝捰恓殃槇柉儙哪奾屚塔怫歒欴欥宋得应慤橫渼勫幪夐旘匯災倛栠係檱浂拝匙喌棲匽憴射婅剋婷崼咮句洋価仔嚂峯暹伮剢亏崢弟沁".toCharArray();
                                int length = charArray.length;
                                for (int i = 0; length > i; i++) {
                                    char c2 = charArray[i];
                                    switch (i % 7) {
                                        case 0:
                                            c = 6;
                                            break;
                                        case 1:
                                            c = 'c';
                                            break;
                                        case 2:
                                            c = 's';
                                            break;
                                        case 3:
                                            c = '0';
                                            break;
                                        case 4:
                                            c = '{';
                                            break;
                                        case 5:
                                            c = '\\';
                                            break;
                                        default:
                                            c = '^';
                                            break;
                                    }
                                    charArray[i] = (char) (c ^ c2);
                                }
                                f6xec147401 = new String(charArray).intern().toCharArray();
                            }

                            /* renamed from: g̵̢̢̛̛͎͈͚̟͎͖͙͖̗̞̫̠͎͍̘͈͕͖͇̯͐͑̔̊͑͛͑͌͑̀̓͠ẙ̵̡̖͚̫̘̩͇͉͔̖͍̹͈̘͕̥͎̻̘͖̲̲͔̦͎̣͖͈̯̹̈́̓̋̈́̋̓͆̒̔̈́̒̎́̏̀͊̅̆̇͝͠͠ͅḋ̴̡̯̱̞͈̦̯͍̩̯͌̀̑̓̔̈́̅̓͋̃͂̈́̈́͆́̄̓́̄̚̕̚͝ḋ̴̡̯̱̞͈̦̯͍̩̯͌̀̑̓̔̈́̅̓͋̃͂̈́̈́͆́̄̓́̄̚̕̚͝j̴̨̛̦̱̦̮̪̲͖̱͚͈̹̭̊̂͛̍̎̇̽͆̎̔̏̂̉̓̓͌̌̂̓͋̐̒̽̂̿̔̈́͗͘̕͝͝͝͝͝ͅj̴̨̛̦̱̦̮̪̲͖̱͚͈̹̭̊̂͛̍̎̇̽͆̎̔̏̂̉̓̓͌̌̂̓͋̐̒̽̂̿̔̈́͗͘̕͝͝͝͝͝ͅ, reason: contains not printable characters */
                            private static /* bridge */ /* synthetic */ String m3xaa5191db(int i, int i2, String str, int i3, int i4) {
                                "t̷̢̨̗̳̹̪̩̣̹̼̹̭̫̮͚̣̹̝͚̞͖͈̹̳͈̙͙͎̼̠̩̜̬̙̰͈̮̰̣͒͐̇̽̇͋̈̓̓̌͒̃̒͜͜͝ͅͅw̶̢̪̤̫̱̩̣͕̱͓̩͓̩̱̞̯͉͔̺̙͇̝̹̻̯̮͔̰̙̾̏̑̑͗̅͆͂͊͛̒͐̓̈́̃͂́͜͠͝ȟ̸̡̢̨͍͚̝̲̝̫̟̲͎̲̼̬̦͓̺̭̼̪̜̠͈̭̗̳̳̣͓̟̲̻̜͇̰̞̝̾͂͌̈́̎́́̔̈́͋̀̿̀̍̈́͆͊̔̿͊̅̓́̈́̆̃̽͛̋͂̄̓̌̂͆̚͜͜͝͝͝͠͝a̸̧̻̭̥̩̮̲̝̹̩͍͚̤͈̠̭͓̜̬̭̥͊͗̓̅͋̉͐̿̐̇̑̓̎̒̔̏̇̃̉̂̾͂͋̌̑̀̾̈́̔̊̓̂́̕̕͘͜͠͠͠͠͝".length();
                                StringBuilder sb = new StringBuilder();
                                char[] charArray = str.toCharArray();
                                "g̵̢̢̛̛͎͈͚̟͎͖͙͖̗̞̫̠͎͍̘͈͕͖͇̯͐͑̔̊͑͛͑͌͑̀̓͠ȟ̸̡̢̨͍͚̝̲̝̫̟̲͎̲̼̬̦͓̺̭̼̪̜̠͈̭̗̳̳̣͓̟̲̻̜͇̰̞̝̾͂͌̈́̎́́̔̈́͋̀̿̀̍̈́͆͊̔̿͊̅̓́̈́̆̃̽͛̋͂̄̓̌̂͆̚͜͜͝͝͝͠͝ȩ̵̛̛̹̱̳̝̱̝̌̊̓̍̋̃͐̂̌͌̔̈́̊̋̔͑̍́͋͆͛̏̑͒͐̃́͝͠͝ͅơ̸̡̡̛͓̰̖͉̤͉̖͔̰͍̤̠̠̱̫͎̭̩͖̻̞̼͓̞͋͐́̉͑̿́͋̌̂̀͊͛̀̄̊͊̓̄͘̚̕̕͜͝͝ͅͅ".length();
                                "a̸̧̻̭̥̩̮̲̝̹̩͍͚̤͈̠̭͓̜̬̭̥͊͗̓̅͋̉͐̿̐̇̑̓̎̒̔̏̇̃̉̂̾͂͋̌̑̀̾̈́̔̊̓̂́̕̕͘͜͠͠͠͠͝ų̴̢̢̨̨̹̩̙͎̝̪͔͖͎͙̙̖̦͍͓͈̰̜͚̤̼̺̯̙͍͖͎̦͔̯̻͚̭̎̾̈́̊͊̇̃̚̚̕ͅ".length();
                                "".length();
                                int length = charArray.length;
                                int i5 = 0;
                                int i6 = 0;
                                while (i5 < length) {
                                    sb.append((char) ((((charArray[i5] ^ f6xec147401[i6 % f6xec147401.length]) ^ ((i3 + i6) ^ i)) ^ i2) ^ i4));
                                    "n̷̢̡̛͕̟͚͙̳̯͇͍͍͙̙͕̲͎͚̦̳͕̱͕̺̱̬͓̖̠̻͎̜̮̥̝̼̋̈́͑͑̾̅̾̐̿".length();
                                    "w̶̢̪̤̫̱̩̣͕̱͓̩͓̩̱̞̯͉͔̺̙͇̝̹̻̯̮͔̰̙̾̏̑̑͗̅͆͂͊͛̒͐̓̈́̃͂́͜͠͝b̶̢̛͚̝̰̺̱̲͖̠̘͚͕͉͇̭̗͇̙̗̣͍̲͖̽͗̐̅̾̅́͌̂̚͘͝q̸͍̟͍͕̹͉̤̱̏̆͗́̈́̓̈̆̊͝͝͝ơ̸̡̡̛͓̰̖͉̤͉̖͔̰͍̤̠̠̱̫͎̭̩͖̻̞̼͓̞͋͐́̉͑̿́͋̌̂̀͊͛̀̄̊͊̓̄͘̚̕̕͜͝͝ͅͅ".length();
                                    "l̶̛͙͖͖͙̻̪̦͚͓̖̳̤͙͖̭͖͖̘̠̠͉̲̬͎̫̼̗̹̪͉͚̫̗͍͉͍̹͕̻̯̰̏͌̊̆̒̈́̍̀́̽̾̎̃̒́̆̽̂̄̆̕͝t̷̢̨̗̳̹̪̩̣̹̼̹̭̫̮͚̣̹̝͚̞͖͈̹̳͈̙͙͎̼̠̩̜̬̙̰͈̮̰̣͒͐̇̽̇͋̈̓̓̌͒̃̒͜͜͝ͅͅz̴̨̧̛̛̛̞̱̗͍̖̰͉̝̯̗̻̰̙̹̺̪̭͇̫̪̫̟̗̖͚̼̩͔̝̥͍̹͈̜̆̉̈́̋̀͐̈́̾̉̀̄̈́̀͗̏͆̾̇̆͑̂̂̔̆̎́̇̕̚͜͜͝͠ơ̸̡̡̛͓̰̖͉̤͉̖͔̰͍̤̠̠̱̫͎̭̩͖̻̞̼͓̞͋͐́̉͑̿́͋̌̂̀͊͛̀̄̊͊̓̄͘̚̕̕͜͝͝ͅͅ".length();
                                    i5++;
                                    i6++;
                                }
                                return sb.toString();
                            }

                            protected /* bridge */ /* synthetic */ void afterHookedMethod(XC_MethodHook.MethodHookParam methodHookParam) throws Throwable {
                                ((Activity) methodHookParam.thisObject).finish();
                                methodHookParam.setResult((Object) null);
                            }
                        };
                        XposedHelpers.findAndHookMethod(m0xbb4d8ad9, classLoader5, m0xbb4d8ad10, objArr3);
                        "ḋ̴̡̯̱̞͈̦̯͍̩̯͌̀̑̓̔̈́̅̓͋̃͂̈́̈́͆́̄̓́̄̚̕̚͝p̸̨̩̤̥̜͔͕̙̲͍͚̮̩͉͎͓̣̗͕̽̉͛͑̀̏̿̾̿̏̾̋͋͊̋́̈́̊̈́͗̃̃̅̈́̇̏̂͑̊̚͝͠".length();
                        "q̸͍̟͍͕̹͉̤̱̏̆͗́̈́̓̈̆̊͝͝͝v̴̧̭̟̳̟͉͎̜̗͍͚̭̙̠͓̝̝̘͇̱͈̊́̆̑̈̽̑͂͒̌̀̓̊̆̆̊̈́̋͐̎̽̇̄͆̅̉̈́̽͆̚̕̕̕̕͜͜".length();
                        "n̷̢̡̛͕̟͚͙̳̯͇͍͍͙̙͕̲͎͚̦̳͕̱͕̺̱̬͓̖̠̻͎̜̮̥̝̼̋̈́͑͑̾̅̾̐̿f̴̡̡̡̢̗̻̮̬͇̪͓̤̣̰̝̩̲͇̹̪̩̻͎͍͙̼̖͈̥̲̱̈̑͆͊͋̍̎́͆͋͛̈̑̾̇̈́͊͘͝͝͝z̴̨̧̛̛̛̞̱̗͍̖̰͉̝̯̗̻̰̙̹̺̪̭͇̫̪̫̟̗̖͚̼̩͔̝̥͍̹͈̜̆̉̈́̋̀͐̈́̾̉̀̄̈́̀͗̏͆̾̇̆͑̂̂̔̆̎́̇̕̚͜͜͝͠".length();
                        "m̵̡̫̙͔̜͙͇͈̝̲̱͕̱̤̟̭̭̙̠͎̬̦͇͎͙͓̰̣̻̥̦̒͊̎̈́̾̾̾͒̃͂͐̉̎̌͂̀͒͗͒̇́̀͛̌́͊̓̈́̀́̀̂̀̕̚̚̚͜͝͝͝͝͝͠͝ȩ̵̛̛̹̱̳̝̱̝̌̊̓̍̋̃͐̂̌͌̔̈́̊̋̔͑̍́͋͆͛̏̑͒͐̃́͝͠͝ͅv̴̧̭̟̳̟͉͎̜̗͍͚̭̙̠͓̝̝̘͇̱͈̊́̆̑̈̽̑͂͒̌̀̓̊̆̆̊̈́̋͐̎̽̇̄͆̅̉̈́̽͆̚̕̕̕̕͜͜".length();
                        "".length();
                    } catch (ClassNotFoundException e) {
                        "".length();
                        "x̴̧̨̨͖̤͙͓͎͎̞͖̮̲̦͖̦̞̘͔̩͓̦̭͍̣͉̹̯͔̖̖͐́͂̉".length();
                        "j̴̨̛̦̱̦̮̪̲͖̱͚͈̹̭̊̂͛̍̎̇̽͆̎̔̏̂̉̓̓͌̌̂̓͋̐̒̽̂̿̔̈́͗͘̕͝͝͝͝͝ͅj̴̨̛̦̱̦̮̪̲͖̱͚͈̹̭̊̂͛̍̎̇̽͆̎̔̏̂̉̓̓͌̌̂̓͋̐̒̽̂̿̔̈́͗͘̕͝͝͝͝͝ͅ".length();
                        "".length();
                        NoClassDefFoundError noClassDefFoundError = new NoClassDefFoundError(e.getMessage());
                        "g̵̢̢̛̛͎͈͚̟͎͖͙͖̗̞̫̠͎͍̘͈͕͖͇̯͐͑̔̊͑͛͑͌͑̀̓͠s̷̢̧̲̱̳̖̬͙̱͕̮̩̺̣̪̼͔̮͚͓͇͓̲̣̥͇̬̪̹̞̼̣͌͊̄̏̅̇̾͜͠ͅv̴̧̭̟̳̟͉͎̜̗͍͚̭̙̠͓̝̝̘͇̱͈̊́̆̑̈̽̑͂͒̌̀̓̊̆̆̊̈́̋͐̎̽̇̄͆̅̉̈́̽͆̚̕̕̕̕͜͜".length();
                        "x̴̧̨̨͖̤͙͓͎͎̞͖̮̲̦͖̦̞̘͔̩͓̦̭͍̣͉̹̯͔̖̖͐́͂̉".length();
                        throw noClassDefFoundError;
                    }
                } catch (ClassNotFoundException e2) {
                    "ḋ̴̡̯̱̞͈̦̯͍̩̯͌̀̑̓̔̈́̅̓͋̃͂̈́̈́͆́̄̓́̄̚̕̚͝l̶̛͙͖͖͙̻̪̦͚͓̖̳̤͙͖̭͖͖̘̠̠͉̲̬͎̫̼̗̹̪͉͚̫̗͍͉͍̹͕̻̯̰̏͌̊̆̒̈́̍̀́̽̾̎̃̒́̆̽̂̄̆̕͝t̷̢̨̗̳̹̪̩̣̹̼̹̭̫̮͚̣̹̝͚̞͖͈̹̳͈̙͙͎̼̠̩̜̬̙̰͈̮̰̣͒͐̇̽̇͋̈̓̓̌͒̃̒͜͜͝ͅͅa̸̧̻̭̥̩̮̲̝̹̩͍͚̤͈̠̭͓̜̬̭̥͊͗̓̅͋̉͐̿̐̇̑̓̎̒̔̏̇̃̉̂̾͂͋̌̑̀̾̈́̔̊̓̂́̕̕͘͜͠͠͠͠͝".length();
                    NoClassDefFoundError noClassDefFoundError2 = new NoClassDefFoundError(e2.getMessage());
                    "ų̴̢̢̨̨̹̩̙͎̝̪͔͖͎͙̙̖̦͍͓͈̰̜͚̤̼̺̯̙͍͖͎̦͔̯̻͚̭̎̾̈́̊͊̇̃̚̚̕ͅȩ̵̛̛̹̱̳̝̱̝̌̊̓̍̋̃͐̂̌͌̔̈́̊̋̔͑̍́͋͆͛̏̑͒͐̃́͝͠͝ͅj̴̨̛̦̱̦̮̪̲͖̱͚͈̹̭̊̂͛̍̎̇̽͆̎̔̏̂̉̓̓͌̌̂̓͋̐̒̽̂̿̔̈́͗͘̕͝͝͝͝͝ͅa̸̧̻̭̥̩̮̲̝̹̩͍͚̤͈̠̭͓̜̬̭̥͊͗̓̅͋̉͐̿̐̇̑̓̎̒̔̏̇̃̉̂̾͂͋̌̑̀̾̈́̔̊̓̂́̕̕͘͜͠͠͠͠͝".length();
                    "g̵̢̢̛̛͎͈͚̟͎͖͙͖̗̞̫̠͎͍̘͈͕͖͇̯͐͑̔̊͑͛͑͌͑̀̓͠".length();
                    throw noClassDefFoundError2;
                }
            } catch (ClassNotFoundException e3) {
                "".length();
                "".length();
                "i̷̢̡̡̢̢̨̹͓̼̦̣͇̖͇͕̬̠̖̗̞̝͖̤̮̠̩̰̰̭̱̟̞͈̫͉̔̽̌̓̏͜͝ͅa̸̧̻̭̥̩̮̲̝̹̩͍͚̤͈̠̭͓̜̬̭̥͊͗̓̅͋̉͐̿̐̇̑̓̎̒̔̏̇̃̉̂̾͂͋̌̑̀̾̈́̔̊̓̂́̕̕͘͜͠͠͠͠͝l̶̛͙͖͖͙̻̪̦͚͓̖̳̤͙͖̭͖͖̘̠̠͉̲̬͎̫̼̗̹̪͉͚̫̗͍͉͍̹͕̻̯̰̏͌̊̆̒̈́̍̀́̽̾̎̃̒́̆̽̂̄̆̕͝ŗ̶̢̢̛̛͇͉͍̪̳̟̞͔̥̣̞̙̩̬̻̱͉͚̭̲̭̫̩̘̺͇̬̱̰͍̖͕͎͎̺̻̪̑͌̋̊̿̆̊͛̅̔̊͛̑̍́͊̐̾͘͜͠͠ͅͅ".length();
                NoClassDefFoundError noClassDefFoundError3 = new NoClassDefFoundError(e3.getMessage());
                "v̴̧̭̟̳̟͉͎̜̗͍͚̭̙̠͓̝̝̘͇̱͈̊́̆̑̈̽̑͂͒̌̀̓̊̆̆̊̈́̋͐̎̽̇̄͆̅̉̈́̽͆̚̕̕̕̕͜͜".length();
                throw noClassDefFoundError3;
            }
        }
    }
}