package com.brazzers.aio;

import android.app.ActionBar;
import android.app.Activity;
import android.os.Bundle;
import android.text.Html;
import android.text.method.LinkMovementMethod;
import android.widget.TextView;

/* loaded from: classes.dex */
public /* synthetic */ class MainActivity extends Activity {

    /* renamed from: F̵̡̧̧̩̜̫̥̝̙̫̘͇̘͍͙̝̪͈̞͚̙̩̞͌̀̓͂̍̑̚̚R̷̨̢̛̖̦̺̻͕̜̪̥̣̮̘̱̉͒͊͋̇͒̇͌̂̂͋̂͋͒̂̐̔͋͌̔̈́͆̒͒̑̿̆͑̿̑̋͒̊̔̏͠͠͠1̵̡̢͈̙͙͍̞̯̪̤̫̦͕͓͍̹̳̞̳̮͓̼͑̄͐̀̕͝Ë̴̢̧̧̡̡̢̧̛̛̠̖̲̘͙͇̤̺͓͖̗̞͖̞̣̮̮͚̦͓͍͖͚̣͙͍̬̞̙̙̖͓̜̽̇̀̉͂̾̓̈́͂́̾͗̽͐ͅͅŅ̸̧̢̧̲̣͙̠̩̲̦̦̻̩̟͖̤͈̲̰̜̍̄ͅD̸̢̧̛̛͖̖̞̩͓̩̫̐̽̐́͂́̆̈̐̀͋̎̎̋̂͋̇̓̀̀̋̉́̂̐̏̎̒̀͌̽̎̚͘̚͠͠Ş̶̢̣̼̬̺̞̮̟̜͖̖̭͙͎̻͖͚͚̲̘̼̫̹̹̖̔_̸̨͉̞̮̟̗̬̭̙͇͙̲̥̯̮͈̬̺̫̞̮̤̔̒͗̽̈́̓̈́͌͒̾̆̈́͑͋̌̉͑̂̏͂̽̍̓͘͜Å̶̡̨̛͈̺͙̳͇̠͙͎̘̼̜̤̪̠̼̲͓͋͊̋̓̿̉͑̑̓͗̐̈́̚͝, reason: contains not printable characters */
    static /* synthetic */ char[] f8x2d4ede4f;

    /* renamed from: F̵̡̧̧̩̜̫̥̝̙̫̘͇̘͍͙̝̪͈̞͚̙̩̞͌̀̓͂̍̑̚̚R̷̨̢̛̖̦̺̻͕̜̪̥̣̮̘̱̉͒͊͋̇͒̇͌̂̂͋̂͋͒̂̐̔͋͌̔̈́͆̒͒̑̿̆͑̿̑̋͒̊̔̏͠͠͠1̵̡̢͈̙͙͍̞̯̪̤̫̦͕͓͍̹̳̞̳̮͓̼͑̄͐̀̕͝Ë̴̢̧̧̡̡̢̧̛̛̠̖̲̘͙͇̤̺͓͖̗̞͖̞̣̮̮͚̦͓͍͖͚̣͙͍̬̞̙̙̖͓̜̽̇̀̉͂̾̓̈́͂́̾͗̽͐ͅͅŅ̸̧̢̧̲̣͙̠̩̲̦̦̻̩̟͖̤͈̲̰̜̍̄ͅD̸̢̧̛̛͖̖̞̩͓̩̫̐̽̐́͂́̆̈̐̀͋̎̎̋̂͋̇̓̀̀̋̉́̂̐̏̎̒̀͌̽̎̚͘̚͠͠Ş̶̢̣̼̬̺̞̮̟̜͖̖̭͙͎̻͖͚͚̲̘̼̫̹̹̖̔_̸̨͉̞̮̟̗̬̭̙͇͙̲̥̯̮͈̬̺̫̞̮̤̔̒͗̽̈́̓̈́͌͒̾̆̈́͑͋̌̉͑̂̏͂̽̍̓͘͜q̸͍̟͍͕̹͉̤̱̏̆͗́̈́̓̈̆̊͝͝͝m̵̡̫̙͔̜͙͇͈̝̲̱͕̱̤̟̭̭̙̠͎̬̦͇͎͙͓̰̣̻̥̦̒͊̎̈́̾̾̾͒̃͂͐̉̎̌͂̀͒͗͒̇́̀͛̌́͊̓̈́̀́̀̂̀̕̚̚̚͜͝͝͝͝͝͠͝n̷̢̡̛͕̟͚͙̳̯͇͍͍͙̙͕̲͎͚̦̳͕̱͕̺̱̬͓̖̠̻͎̜̮̥̝̼̋̈́͑͑̾̅̾̐̿k̶̨̢̡̧̧̛̼̠̺̻̱̪̟͕̻̮̼̲̥̭͚͓͖͙̼̤̠̃̐̑͊͒͛͗̈́͂̾̓̾̎̿̆̅̊̒̈́͐̍̒̉̈́̈́̽͑̄̈́̊̄̒͆̾̎̕̕̚̕͜n̷̢̡̛͕̟͚͙̳̯͇͍͍͙̙͕̲͎͚̦̳͕̱͕̺̱̬͓̖̠̻͎̜̮̥̝̼̋̈́͑͑̾̅̾̐̿ẙ̵̡̖͚̫̘̩͇͉͔̖͍̹͈̘͕̥͎̻̘͖̲̲͔̦͎̣͖͈̯̹̈́̓̋̈́̋̓͆̒̔̈́̒̎́̏̀͊̅̆̇͝͠͠ͅȟ̸̡̢̨͍͚̝̲̝̫̟̲͎̲̼̬̦͓̺̭̼̪̜̠͈̭̗̳̳̣͓̟̲̻̜͇̰̞̝̾͂͌̈́̎́́̔̈́͋̀̿̀̍̈́͆͊̔̿͊̅̓́̈́̆̃̽͛̋͂̄̓̌̂͆̚͜͜͝͝͝͠͝f̴̡̡̡̢̗̻̮̬͇̪͓̤̣̰̝̩̲͇̹̪̩̻͎͍͙̼̖͈̥̲̱̈̑͆͊͋̍̎́͆͋͛̈̑̾̇̈́͊͘͝͝͝j̴̨̛̦̱̦̮̪̲͖̱͚͈̹̭̊̂͛̍̎̇̽͆̎̔̏̂̉̓̓͌̌̂̓͋̐̒̽̂̿̔̈́͗͘̕͝͝͝͝͝ͅȟ̸̡̢̨͍͚̝̲̝̫̟̲͎̲̼̬̦͓̺̭̼̪̜̠͈̭̗̳̳̣͓̟̲̻̜͇̰̞̝̾͂͌̈́̎́́̔̈́͋̀̿̀̍̈́͆͊̔̿͊̅̓́̈́̆̃̽͛̋͂̄̓̌̂͆̚͜͜͝͝͝͠͝n̷̢̡̛͕̟͚͙̳̯͇͍͍͙̙͕̲͎͚̦̳͕̱͕̺̱̬͓̖̠̻͎̜̮̥̝̼̋̈́͑͑̾̅̾̐̿k̶̨̢̡̧̧̛̼̠̺̻̱̪̟͕̻̮̼̲̥̭͚͓͖͙̼̤̠̃̐̑͊͒͛͗̈́͂̾̓̾̎̿̆̅̊̒̈́͐̍̒̉̈́̈́̽͑̄̈́̊̄̒͆̾̎̕̕̚̕͜, reason: contains not printable characters */
    static final int f9x8a80c604 = 0;

    static {
        char c;
        char[] charArray = "\u0004̛͉ͥ͵͐͵͏̸̟̠̿̄́ͣ̐̅͞Ϳ̶̯͈̅͡ͼͻ͠Ϳ͜ʹ̜̌\u0378\u0018̀͋ͼ͏̘̰̬̪ͮ̎̇ͮͤ́ͥ̀̾̑ͮ͡͞ͳ̴̢̼͙͎͔͙̼̤̪͎̄͗͌͗̾͛̐̑̑͜\u0378̶̴̹͐͌ͯ̔ͬ̇̕WͿͦ͆;̐\u0378̖ͦ̂͛ͷ͈̻͉̣̓̅͠͠Ͱ̵̇̎ͱ̶̵̰̋ͶrͶ̸̢̦̦̓͵ͼ̽́ͧͽ̡͕͋̉̓̾̈́ͪ̕Ͱ̶̀ͼ̡ͮ̍̑\u0378̢̻̰͈̖̒̏̐̍̋̐ͤ͜ͽ̸̤̰̘͔̮͖̹ͨͨ̐̍ͨ͊͛͜(Ͳ̺̜̦͆ͼ͆ͣ̐Ͱ̣̞̈͏̧͕ͥ̊ͭ́͡\u0378ͲͲ̲A̝Ͷͷ̧̧̢̣͙͎̭̹͉̬͎̓ͬ̄ͮ͐̾̈́ͅ͵̷̧̧͉͚͍̠̗̥͊̄̾͗ͼ̆̊͌\u0378̧̳\u0378̮ͣ̐̑̇v̩̟͐̔ͥ̒͞\u0378̨ͤ͞\u0378̓̈̿̄̕\u0379\u0378͟Ϳ͔̗̼̳͒̋ͩ9Ͳ̣͐Ͷ̢̘͙͒ͳ̎ͼ̢̛̻̣ͼ̧̧͎͔ͩ̈̊͏̽͌\u0379\u0378̨͕̭ͤ̂̈Ϳ̍ͮͰ̪̮̰̫̋̋ͦ̍ͩ́両呈晪岾婻揆埛可夥栞敪淾俕澚倂棸孑曺唜咞油檝歆廨喬俶派想墚哸櫊圢恧搑峚愵响凟廟悈勅典侈厑崦氀伝柗喥淵枾小溁分乔湭喤烞泝汮峖栉枎姰枞滝握姳丽劝岜印梋揂歟倫旭淕怽夜啔忬怙構匶嗿澽刪扮冽啔欛橋汷朔囖抧叜悈巬栣".toCharArray();
        int length = charArray.length;
        for (int i = 0; length > i; i++) {
            char c2 = charArray[i];
            switch (i % 7) {
                case 0:
                    c = 'B';
                    break;
                case 1:
                    c = '.';
                    break;
                case 2:
                    c = 5;
                    break;
                case 3:
                    c = '%';
                    break;
                case 4:
                    c = 'f';
                    break;
                case 5:
                    c = 'J';
                    break;
                default:
                    c = '7';
                    break;
            }
            charArray[i] = (char) (c ^ c2);
        }
        f8x2d4ede4f = new String(charArray).intern().toCharArray();
    }

    /* renamed from: w̶̢̪̤̫̱̩̣͕̱͓̩͓̩̱̞̯͉͔̺̙͇̝̹̻̯̮͔̰̙̾̏̑̑͗̅͆͂͊͛̒͐̓̈́̃͂́͜͠͝q̸͍̟͍͕̹͉̤̱̏̆͗́̈́̓̈̆̊͝͝͝s̷̢̧̲̱̳̖̬͙̱͕̮̩̺̣̪̼͔̮͚͓͇͓̲̣̥͇̬̪̹̞̼̣͌͊̄̏̅̇̾͜͠ͅt̷̢̨̗̳̹̪̩̣̹̼̹̭̫̮͚̣̹̝͚̞͖͈̹̳͈̙͙͎̼̠̩̜̬̙̰͈̮̰̣͒͐̇̽̇͋̈̓̓̌͒̃̒͜͜͝ͅͅa̸̧̻̭̥̩̮̲̝̹̩͍͚̤͈̠̭͓̜̬̭̥͊͗̓̅͋̉͐̿̐̇̑̓̎̒̔̏̇̃̉̂̾͂͋̌̑̀̾̈́̔̊̓̂́̕̕͘͜͠͠͠͠͝ŗ̶̢̢̛̛͇͉͍̪̳̟̞͔̥̣̞̙̩̬̻̱͉͚̭̲̭̫̩̘̺͇̬̱̰͍̖͕͎͎̺̻̪̑͌̋̊̿̆̊͛̅̔̊͛̑̍́͊̐̾͘͜͠͠ͅͅ, reason: contains not printable characters */
    private static /* bridge */ /* synthetic */ String m4x4b55f48b(int i, int i2, String str, int i3, int i4) {
        "s̷̢̧̲̱̳̖̬͙̱͕̮̩̺̣̪̼͔̮͚͓͇͓̲̣̥͇̬̪̹̞̼̣͌͊̄̏̅̇̾͜͠ͅŗ̶̢̢̛̛͇͉͍̪̳̟̞͔̥̣̞̙̩̬̻̱͉͚̭̲̭̫̩̘̺͇̬̱̰͍̖͕͎͎̺̻̪̑͌̋̊̿̆̊͛̅̔̊͛̑̍́͊̐̾͘͜͠͠ͅͅ".length();
        "m̵̡̫̙͔̜͙͇͈̝̲̱͕̱̤̟̭̭̙̠͎̬̦͇͎͙͓̰̣̻̥̦̒͊̎̈́̾̾̾͒̃͂͐̉̎̌͂̀͒͗͒̇́̀͛̌́͊̓̈́̀́̀̂̀̕̚̚̚͜͝͝͝͝͝͠͝ẙ̵̡̖͚̫̘̩͇͉͔̖͍̹͈̘͕̥͎̻̘͖̲̲͔̦͎̣͖͈̯̹̈́̓̋̈́̋̓͆̒̔̈́̒̎́̏̀͊̅̆̇͝͠͠ͅ".length();
        "ȟ̸̡̢̨͍͚̝̲̝̫̟̲͎̲̼̬̦͓̺̭̼̪̜̠͈̭̗̳̳̣͓̟̲̻̜͇̰̞̝̾͂͌̈́̎́́̔̈́͋̀̿̀̍̈́͆͊̔̿͊̅̓́̈́̆̃̽͛̋͂̄̓̌̂͆̚͜͜͝͝͝͠͝g̵̢̢̛̛͎͈͚̟͎͖͙͖̗̞̫̠͎͍̘͈͕͖͇̯͐͑̔̊͑͛͑͌͑̀̓͠ȩ̵̛̛̹̱̳̝̱̝̌̊̓̍̋̃͐̂̌͌̔̈́̊̋̔͑̍́͋͆͛̏̑͒͐̃́͝͠͝ͅa̸̧̻̭̥̩̮̲̝̹̩͍͚̤͈̠̭͓̜̬̭̥͊͗̓̅͋̉͐̿̐̇̑̓̎̒̔̏̇̃̉̂̾͂͋̌̑̀̾̈́̔̊̓̂́̕̕͘͜͠͠͠͠͝".length();
        StringBuilder sb = new StringBuilder();
        char[] charArray = str.toCharArray();
        "p̸̨̩̤̥̜͔͕̙̲͍͚̮̩͉͎͓̣̗͕̽̉͛͑̀̏̿̾̿̏̾̋͋͊̋́̈́̊̈́͗̃̃̅̈́̇̏̂͑̊̚͝͠g̵̢̢̛̛͎͈͚̟͎͖͙͖̗̞̫̠͎͍̘͈͕͖͇̯͐͑̔̊͑͛͑͌͑̀̓͠".length();
        "t̷̢̨̗̳̹̪̩̣̹̼̹̭̫̮͚̣̹̝͚̞͖͈̹̳͈̙͙͎̼̠̩̜̬̙̰͈̮̰̣͒͐̇̽̇͋̈̓̓̌͒̃̒͜͜͝ͅͅ".length();
        int length = charArray.length;
        int i5 = 0;
        int i6 = 0;
        while (i5 < length) {
            sb.append((char) ((((charArray[i5] ^ f8x2d4ede4f[i6 % f8x2d4ede4f.length]) ^ ((i3 + i6) ^ i)) ^ i2) ^ i4));
            "ẙ̵̡̖͚̫̘̩͇͉͔̖͍̹͈̘͕̥͎̻̘͖̲̲͔̦͎̣͖͈̯̹̈́̓̋̈́̋̓͆̒̔̈́̒̎́̏̀͊̅̆̇͝͠͠ͅ".length();
            "x̴̧̨̨͖̤͙͓͎͎̞͖̮̲̦͖̦̞̘͔̩͓̦̭͍̣͉̹̯͔̖̖͐́͂̉".length();
            i5++;
            i6++;
        }
        return sb.toString();
    }

    @Override // android.app.Activity
    protected /* bridge */ /* synthetic */ void onCreate(Bundle bundle) {
        super.onCreate(bundle);
        setContentView(R.layout.__res_0x7f050000);
        ActionBar actionBar = getActionBar();
        if (actionBar != null) {
            actionBar.setSubtitle(m4x4b55f48b(1285695914, 1808763837, "摑杢朅朖杘杈", 370729891, 1213867477));
        }
        TextView textView = (TextView) findViewById(R.id.__res_0x7f040000);
        m4x4b55f48b(-2145165371, 1615058118, "띫됮둃둛됂됙둁", -544046901, 98745525);
        textView.setText(Html.fromHtml("<b>Patched by:&nbsp;</b><font color=\"#FF9300\"><a href=https://t.me/youarefinished_mods>youarefinished</a></font> 👻"));
        textView.setMovementMethod(LinkMovementMethod.getInstance());
    }
}